Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* -------- USBHS_DEVEPTISR : (USBHS Offset: 0x130) (R/ 32) Device Endpoint Interrupt Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t TXINI:1;                   /**< bit:      0  Transmitted IN Data Interrupt            */
    uint32_t RXOUTI:1;                  /**< bit:      1  Received OUT Data Interrupt              */
    uint32_t :3;                        /**< bit:   2..4  Reserved */
    uint32_t OVERFI:1;                  /**< bit:      5  Overflow Interrupt                       */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKET:1;             /**< bit:      7  Short Packet Interrupt                   */
    uint32_t DTSEQ:2;                   /**< bit:   8..9  Data Toggle Sequence                     */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t NBUSYBK:2;                 /**< bit: 12..13  Number of Busy Banks                     */
    uint32_t CURRBK:2;                  /**< bit: 14..15  Current Bank                             */
    uint32_t RWALL:1;                   /**< bit:     16  Read/Write Allowed                       */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t CFGOK:1;                   /**< bit:     18  Configuration OK Status                  */
    uint32_t :1;                        /**< bit:     19  Reserved */
    uint32_t BYCT:11;                   /**< bit: 20..30  Byte Count                               */
    uint32_t :1;                        /**< bit:     31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPI:1;                  /**< bit:      2  Received SETUP Interrupt                 */
    uint32_t NAKOUTI:1;                 /**< bit:      3  NAKed OUT Interrupt                      */
    uint32_t NAKINI:1;                  /**< bit:      4  NAKed IN Interrupt                       */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDI:1;                /**< bit:      6  STALLed Interrupt                        */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t CTRLDIR:1;                 /**< bit:     17  Control Direction                        */
    uint32_t :14;                       /**< bit: 18..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFI:1;                 /**< bit:      2  Underflow Interrupt                      */
    uint32_t HBISOINERRI:1;             /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt */
    uint32_t HBISOFLUSHI:1;             /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t CRCERRI:1;                 /**< bit:      6  CRC Error Interrupt                      */
    uint32_t :3;                        /**< bit:   7..9  Reserved */
    uint32_t ERRORTRANS:1;              /**< bit:     10  High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt */
    uint32_t :21;                       /**< bit: 11..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPI:1;                  /**< bit:      2  Received SETUP Interrupt                 */
    uint32_t NAKOUTI:1;                 /**< bit:      3  NAKed OUT Interrupt                      */
    uint32_t NAKINI:1;                  /**< bit:      4  NAKed IN Interrupt                       */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDI:1;                /**< bit:      6  STALLed Interrupt                        */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t CTRLDIR:1;                 /**< bit:     17  Control Direction                        */
    uint32_t :14;                       /**< bit: 18..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPI:1;                  /**< bit:      2  Received SETUP Interrupt                 */
    uint32_t NAKOUTI:1;                 /**< bit:      3  NAKed OUT Interrupt                      */
    uint32_t NAKINI:1;                  /**< bit:      4  NAKed IN Interrupt                       */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDI:1;                /**< bit:      6  STALLed Interrupt                        */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t CTRLDIR:1;                 /**< bit:     17  Control Direction                        */
    uint32_t :14;                       /**< bit: 18..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_DEVEPTISR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_DEVEPTISR_OFFSET              (0x130)                                       /**<  (USBHS_DEVEPTISR) Device Endpoint Interrupt Status Register  Offset */

#define USBHS_DEVEPTISR_TXINI_Pos           0                                              /**< (USBHS_DEVEPTISR) Transmitted IN Data Interrupt Position */
#define USBHS_DEVEPTISR_TXINI_Msk           (_U_(0x1) << USBHS_DEVEPTISR_TXINI_Pos)        /**< (USBHS_DEVEPTISR) Transmitted IN Data Interrupt Mask */
#define USBHS_DEVEPTISR_TXINI               USBHS_DEVEPTISR_TXINI_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_TXINI_Msk instead */
#define USBHS_DEVEPTISR_RXOUTI_Pos          1                                              /**< (USBHS_DEVEPTISR) Received OUT Data Interrupt Position */
#define USBHS_DEVEPTISR_RXOUTI_Msk          (_U_(0x1) << USBHS_DEVEPTISR_RXOUTI_Pos)       /**< (USBHS_DEVEPTISR) Received OUT Data Interrupt Mask */
#define USBHS_DEVEPTISR_RXOUTI              USBHS_DEVEPTISR_RXOUTI_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_RXOUTI_Msk instead */
#define USBHS_DEVEPTISR_OVERFI_Pos          5                                              /**< (USBHS_DEVEPTISR) Overflow Interrupt Position */
#define USBHS_DEVEPTISR_OVERFI_Msk          (_U_(0x1) << USBHS_DEVEPTISR_OVERFI_Pos)       /**< (USBHS_DEVEPTISR) Overflow Interrupt Mask */
#define USBHS_DEVEPTISR_OVERFI              USBHS_DEVEPTISR_OVERFI_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_OVERFI_Msk instead */
#define USBHS_DEVEPTISR_SHORTPACKET_Pos     7                                              /**< (USBHS_DEVEPTISR) Short Packet Interrupt Position */
#define USBHS_DEVEPTISR_SHORTPACKET_Msk     (_U_(0x1) << USBHS_DEVEPTISR_SHORTPACKET_Pos)  /**< (USBHS_DEVEPTISR) Short Packet Interrupt Mask */
#define USBHS_DEVEPTISR_SHORTPACKET         USBHS_DEVEPTISR_SHORTPACKET_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_SHORTPACKET_Msk instead */
#define USBHS_DEVEPTISR_DTSEQ_Pos           8                                              /**< (USBHS_DEVEPTISR) Data Toggle Sequence Position */
#define USBHS_DEVEPTISR_DTSEQ_Msk           (_U_(0x3) << USBHS_DEVEPTISR_DTSEQ_Pos)        /**< (USBHS_DEVEPTISR) Data Toggle Sequence Mask */
#define USBHS_DEVEPTISR_DTSEQ(value)        (USBHS_DEVEPTISR_DTSEQ_Msk & ((value) << USBHS_DEVEPTISR_DTSEQ_Pos))
#define   USBHS_DEVEPTISR_DTSEQ_DATA0_Val   _U_(0x0)                                       /**< (USBHS_DEVEPTISR) Data0 toggle sequence  */
#define   USBHS_DEVEPTISR_DTSEQ_DATA1_Val   _U_(0x1)                                       /**< (USBHS_DEVEPTISR) Data1 toggle sequence  */
#define   USBHS_DEVEPTISR_DTSEQ_DATA2_Val   _U_(0x2)                                       /**< (USBHS_DEVEPTISR) Reserved for high-bandwidth isochronous endpoint  */
#define   USBHS_DEVEPTISR_DTSEQ_MDATA_Val   _U_(0x3)                                       /**< (USBHS_DEVEPTISR) Reserved for high-bandwidth isochronous endpoint  */
#define USBHS_DEVEPTISR_DTSEQ_DATA0         (USBHS_DEVEPTISR_DTSEQ_DATA0_Val << USBHS_DEVEPTISR_DTSEQ_Pos)  /**< (USBHS_DEVEPTISR) Data0 toggle sequence Position  */
#define USBHS_DEVEPTISR_DTSEQ_DATA1         (USBHS_DEVEPTISR_DTSEQ_DATA1_Val << USBHS_DEVEPTISR_DTSEQ_Pos)  /**< (USBHS_DEVEPTISR) Data1 toggle sequence Position  */
#define USBHS_DEVEPTISR_DTSEQ_DATA2         (USBHS_DEVEPTISR_DTSEQ_DATA2_Val << USBHS_DEVEPTISR_DTSEQ_Pos)  /**< (USBHS_DEVEPTISR) Reserved for high-bandwidth isochronous endpoint Position  */
#define USBHS_DEVEPTISR_DTSEQ_MDATA         (USBHS_DEVEPTISR_DTSEQ_MDATA_Val << USBHS_DEVEPTISR_DTSEQ_Pos)  /**< (USBHS_DEVEPTISR) Reserved for high-bandwidth isochronous endpoint Position  */
#define USBHS_DEVEPTISR_NBUSYBK_Pos         12                                             /**< (USBHS_DEVEPTISR) Number of Busy Banks Position */
#define USBHS_DEVEPTISR_NBUSYBK_Msk         (_U_(0x3) << USBHS_DEVEPTISR_NBUSYBK_Pos)      /**< (USBHS_DEVEPTISR) Number of Busy Banks Mask */
#define USBHS_DEVEPTISR_NBUSYBK(value)      (USBHS_DEVEPTISR_NBUSYBK_Msk & ((value) << USBHS_DEVEPTISR_NBUSYBK_Pos))
#define   USBHS_DEVEPTISR_NBUSYBK_0_BUSY_Val _U_(0x0)                                       /**< (USBHS_DEVEPTISR) 0 busy bank (all banks free)  */
#define   USBHS_DEVEPTISR_NBUSYBK_1_BUSY_Val _U_(0x1)                                       /**< (USBHS_DEVEPTISR) 1 busy bank  */
#define   USBHS_DEVEPTISR_NBUSYBK_2_BUSY_Val _U_(0x2)                                       /**< (USBHS_DEVEPTISR) 2 busy banks  */
#define   USBHS_DEVEPTISR_NBUSYBK_3_BUSY_Val _U_(0x3)                                       /**< (USBHS_DEVEPTISR) 3 busy banks  */
#define USBHS_DEVEPTISR_NBUSYBK_0_BUSY      (USBHS_DEVEPTISR_NBUSYBK_0_BUSY_Val << USBHS_DEVEPTISR_NBUSYBK_Pos)  /**< (USBHS_DEVEPTISR) 0 busy bank (all banks free) Position  */
#define USBHS_DEVEPTISR_NBUSYBK_1_BUSY      (USBHS_DEVEPTISR_NBUSYBK_1_BUSY_Val << USBHS_DEVEPTISR_NBUSYBK_Pos)  /**< (USBHS_DEVEPTISR) 1 busy bank Position  */
#define USBHS_DEVEPTISR_NBUSYBK_2_BUSY      (USBHS_DEVEPTISR_NBUSYBK_2_BUSY_Val << USBHS_DEVEPTISR_NBUSYBK_Pos)  /**< (USBHS_DEVEPTISR) 2 busy banks Position  */
#define USBHS_DEVEPTISR_NBUSYBK_3_BUSY      (USBHS_DEVEPTISR_NBUSYBK_3_BUSY_Val << USBHS_DEVEPTISR_NBUSYBK_Pos)  /**< (USBHS_DEVEPTISR) 3 busy banks Position  */
#define USBHS_DEVEPTISR_CURRBK_Pos          14                                             /**< (USBHS_DEVEPTISR) Current Bank Position */
#define USBHS_DEVEPTISR_CURRBK_Msk          (_U_(0x3) << USBHS_DEVEPTISR_CURRBK_Pos)       /**< (USBHS_DEVEPTISR) Current Bank Mask */
#define USBHS_DEVEPTISR_CURRBK(value)       (USBHS_DEVEPTISR_CURRBK_Msk & ((value) << USBHS_DEVEPTISR_CURRBK_Pos))
#define   USBHS_DEVEPTISR_CURRBK_BANK0_Val  _U_(0x0)                                       /**< (USBHS_DEVEPTISR) Current bank is bank0  */
#define   USBHS_DEVEPTISR_CURRBK_BANK1_Val  _U_(0x1)                                       /**< (USBHS_DEVEPTISR) Current bank is bank1  */
#define   USBHS_DEVEPTISR_CURRBK_BANK2_Val  _U_(0x2)                                       /**< (USBHS_DEVEPTISR) Current bank is bank2  */
#define USBHS_DEVEPTISR_CURRBK_BANK0        (USBHS_DEVEPTISR_CURRBK_BANK0_Val << USBHS_DEVEPTISR_CURRBK_Pos)  /**< (USBHS_DEVEPTISR) Current bank is bank0 Position  */
#define USBHS_DEVEPTISR_CURRBK_BANK1        (USBHS_DEVEPTISR_CURRBK_BANK1_Val << USBHS_DEVEPTISR_CURRBK_Pos)  /**< (USBHS_DEVEPTISR) Current bank is bank1 Position  */
#define USBHS_DEVEPTISR_CURRBK_BANK2        (USBHS_DEVEPTISR_CURRBK_BANK2_Val << USBHS_DEVEPTISR_CURRBK_Pos)  /**< (USBHS_DEVEPTISR) Current bank is bank2 Position  */
#define USBHS_DEVEPTISR_RWALL_Pos           16                                             /**< (USBHS_DEVEPTISR) Read/Write Allowed Position */
#define USBHS_DEVEPTISR_RWALL_Msk           (_U_(0x1) << USBHS_DEVEPTISR_RWALL_Pos)        /**< (USBHS_DEVEPTISR) Read/Write Allowed Mask */
#define USBHS_DEVEPTISR_RWALL               USBHS_DEVEPTISR_RWALL_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_RWALL_Msk instead */
#define USBHS_DEVEPTISR_CFGOK_Pos           18                                             /**< (USBHS_DEVEPTISR) Configuration OK Status Position */
#define USBHS_DEVEPTISR_CFGOK_Msk           (_U_(0x1) << USBHS_DEVEPTISR_CFGOK_Pos)        /**< (USBHS_DEVEPTISR) Configuration OK Status Mask */
#define USBHS_DEVEPTISR_CFGOK               USBHS_DEVEPTISR_CFGOK_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_CFGOK_Msk instead */
#define USBHS_DEVEPTISR_BYCT_Pos            20                                             /**< (USBHS_DEVEPTISR) Byte Count Position */
#define USBHS_DEVEPTISR_BYCT_Msk            (_U_(0x7FF) << USBHS_DEVEPTISR_BYCT_Pos)       /**< (USBHS_DEVEPTISR) Byte Count Mask */
#define USBHS_DEVEPTISR_BYCT(value)         (USBHS_DEVEPTISR_BYCT_Msk & ((value) << USBHS_DEVEPTISR_BYCT_Pos))
#define USBHS_DEVEPTISR_MASK                _U_(0x7FF5F3A3)                                /**< \deprecated (USBHS_DEVEPTISR) Register MASK  (Use USBHS_DEVEPTISR_Msk instead)  */
#define USBHS_DEVEPTISR_Msk                 _U_(0x7FF5F3A3)                                /**< (USBHS_DEVEPTISR) Register Mask  */

/* CTRL mode */
#define USBHS_DEVEPTISR_CTRL_RXSTPI_Pos     2                                              /**< (USBHS_DEVEPTISR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTISR_CTRL_RXSTPI_Msk     (_U_(0x1) << USBHS_DEVEPTISR_CTRL_RXSTPI_Pos)  /**< (USBHS_DEVEPTISR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTISR_CTRL_RXSTPI         USBHS_DEVEPTISR_CTRL_RXSTPI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_CTRL_RXSTPI_Msk instead */
#define USBHS_DEVEPTISR_CTRL_NAKOUTI_Pos    3                                              /**< (USBHS_DEVEPTISR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTISR_CTRL_NAKOUTI_Msk    (_U_(0x1) << USBHS_DEVEPTISR_CTRL_NAKOUTI_Pos)  /**< (USBHS_DEVEPTISR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTISR_CTRL_NAKOUTI        USBHS_DEVEPTISR_CTRL_NAKOUTI_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_CTRL_NAKOUTI_Msk instead */
#define USBHS_DEVEPTISR_CTRL_NAKINI_Pos     4                                              /**< (USBHS_DEVEPTISR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTISR_CTRL_NAKINI_Msk     (_U_(0x1) << USBHS_DEVEPTISR_CTRL_NAKINI_Pos)  /**< (USBHS_DEVEPTISR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTISR_CTRL_NAKINI         USBHS_DEVEPTISR_CTRL_NAKINI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_CTRL_NAKINI_Msk instead */
#define USBHS_DEVEPTISR_CTRL_STALLEDI_Pos   6                                              /**< (USBHS_DEVEPTISR) STALLed Interrupt Position */
#define USBHS_DEVEPTISR_CTRL_STALLEDI_Msk   (_U_(0x1) << USBHS_DEVEPTISR_CTRL_STALLEDI_Pos)  /**< (USBHS_DEVEPTISR) STALLed Interrupt Mask */
#define USBHS_DEVEPTISR_CTRL_STALLEDI       USBHS_DEVEPTISR_CTRL_STALLEDI_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_CTRL_STALLEDI_Msk instead */
#define USBHS_DEVEPTISR_CTRL_CTRLDIR_Pos    17                                             /**< (USBHS_DEVEPTISR) Control Direction Position */
#define USBHS_DEVEPTISR_CTRL_CTRLDIR_Msk    (_U_(0x1) << USBHS_DEVEPTISR_CTRL_CTRLDIR_Pos)  /**< (USBHS_DEVEPTISR) Control Direction Mask */
#define USBHS_DEVEPTISR_CTRL_CTRLDIR        USBHS_DEVEPTISR_CTRL_CTRLDIR_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_CTRL_CTRLDIR_Msk instead */
#define USBHS_DEVEPTISR_CTRL_MASK           _U_(0x2005C)                                   /**< \deprecated (USBHS_DEVEPTISR_CTRL) Register MASK  (Use USBHS_DEVEPTISR_CTRL_Msk instead)  */
#define USBHS_DEVEPTISR_CTRL_Msk            _U_(0x2005C)                                   /**< (USBHS_DEVEPTISR_CTRL) Register Mask  */

