Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* ISO mode */
#define USBHS_DEVEPTISR_ISO_UNDERFI_Pos     2                                              /**< (USBHS_DEVEPTISR) Underflow Interrupt Position */
#define USBHS_DEVEPTISR_ISO_UNDERFI_Msk     (_U_(0x1) << USBHS_DEVEPTISR_ISO_UNDERFI_Pos)  /**< (USBHS_DEVEPTISR) Underflow Interrupt Mask */
#define USBHS_DEVEPTISR_ISO_UNDERFI         USBHS_DEVEPTISR_ISO_UNDERFI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_ISO_UNDERFI_Msk instead */
#define USBHS_DEVEPTISR_ISO_HBISOINERRI_Pos 3                                              /**< (USBHS_DEVEPTISR) High Bandwidth Isochronous IN Underflow Error Interrupt Position */
#define USBHS_DEVEPTISR_ISO_HBISOINERRI_Msk (_U_(0x1) << USBHS_DEVEPTISR_ISO_HBISOINERRI_Pos)  /**< (USBHS_DEVEPTISR) High Bandwidth Isochronous IN Underflow Error Interrupt Mask */
#define USBHS_DEVEPTISR_ISO_HBISOINERRI     USBHS_DEVEPTISR_ISO_HBISOINERRI_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_ISO_HBISOINERRI_Msk instead */
#define USBHS_DEVEPTISR_ISO_HBISOFLUSHI_Pos 4                                              /**< (USBHS_DEVEPTISR) High Bandwidth Isochronous IN Flush Interrupt Position */
#define USBHS_DEVEPTISR_ISO_HBISOFLUSHI_Msk (_U_(0x1) << USBHS_DEVEPTISR_ISO_HBISOFLUSHI_Pos)  /**< (USBHS_DEVEPTISR) High Bandwidth Isochronous IN Flush Interrupt Mask */
#define USBHS_DEVEPTISR_ISO_HBISOFLUSHI     USBHS_DEVEPTISR_ISO_HBISOFLUSHI_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_ISO_HBISOFLUSHI_Msk instead */
#define USBHS_DEVEPTISR_ISO_CRCERRI_Pos     6                                              /**< (USBHS_DEVEPTISR) CRC Error Interrupt Position */
#define USBHS_DEVEPTISR_ISO_CRCERRI_Msk     (_U_(0x1) << USBHS_DEVEPTISR_ISO_CRCERRI_Pos)  /**< (USBHS_DEVEPTISR) CRC Error Interrupt Mask */
#define USBHS_DEVEPTISR_ISO_CRCERRI         USBHS_DEVEPTISR_ISO_CRCERRI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_ISO_CRCERRI_Msk instead */
#define USBHS_DEVEPTISR_ISO_ERRORTRANS_Pos  10                                             /**< (USBHS_DEVEPTISR) High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt Position */
#define USBHS_DEVEPTISR_ISO_ERRORTRANS_Msk  (_U_(0x1) << USBHS_DEVEPTISR_ISO_ERRORTRANS_Pos)  /**< (USBHS_DEVEPTISR) High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt Mask */
#define USBHS_DEVEPTISR_ISO_ERRORTRANS      USBHS_DEVEPTISR_ISO_ERRORTRANS_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_ISO_ERRORTRANS_Msk instead */
#define USBHS_DEVEPTISR_ISO_MASK            _U_(0x45C)                                     /**< \deprecated (USBHS_DEVEPTISR_ISO) Register MASK  (Use USBHS_DEVEPTISR_ISO_Msk instead)  */
#define USBHS_DEVEPTISR_ISO_Msk             _U_(0x45C)                                     /**< (USBHS_DEVEPTISR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_DEVEPTISR_BLK_RXSTPI_Pos      2                                              /**< (USBHS_DEVEPTISR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTISR_BLK_RXSTPI_Msk      (_U_(0x1) << USBHS_DEVEPTISR_BLK_RXSTPI_Pos)   /**< (USBHS_DEVEPTISR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTISR_BLK_RXSTPI          USBHS_DEVEPTISR_BLK_RXSTPI_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_BLK_RXSTPI_Msk instead */
#define USBHS_DEVEPTISR_BLK_NAKOUTI_Pos     3                                              /**< (USBHS_DEVEPTISR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTISR_BLK_NAKOUTI_Msk     (_U_(0x1) << USBHS_DEVEPTISR_BLK_NAKOUTI_Pos)  /**< (USBHS_DEVEPTISR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTISR_BLK_NAKOUTI         USBHS_DEVEPTISR_BLK_NAKOUTI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_BLK_NAKOUTI_Msk instead */
#define USBHS_DEVEPTISR_BLK_NAKINI_Pos      4                                              /**< (USBHS_DEVEPTISR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTISR_BLK_NAKINI_Msk      (_U_(0x1) << USBHS_DEVEPTISR_BLK_NAKINI_Pos)   /**< (USBHS_DEVEPTISR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTISR_BLK_NAKINI          USBHS_DEVEPTISR_BLK_NAKINI_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_BLK_NAKINI_Msk instead */
#define USBHS_DEVEPTISR_BLK_STALLEDI_Pos    6                                              /**< (USBHS_DEVEPTISR) STALLed Interrupt Position */
#define USBHS_DEVEPTISR_BLK_STALLEDI_Msk    (_U_(0x1) << USBHS_DEVEPTISR_BLK_STALLEDI_Pos)  /**< (USBHS_DEVEPTISR) STALLed Interrupt Mask */
#define USBHS_DEVEPTISR_BLK_STALLEDI        USBHS_DEVEPTISR_BLK_STALLEDI_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_BLK_STALLEDI_Msk instead */
#define USBHS_DEVEPTISR_BLK_CTRLDIR_Pos     17                                             /**< (USBHS_DEVEPTISR) Control Direction Position */
#define USBHS_DEVEPTISR_BLK_CTRLDIR_Msk     (_U_(0x1) << USBHS_DEVEPTISR_BLK_CTRLDIR_Pos)  /**< (USBHS_DEVEPTISR) Control Direction Mask */
#define USBHS_DEVEPTISR_BLK_CTRLDIR         USBHS_DEVEPTISR_BLK_CTRLDIR_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_BLK_CTRLDIR_Msk instead */
#define USBHS_DEVEPTISR_BLK_MASK            _U_(0x2005C)                                   /**< \deprecated (USBHS_DEVEPTISR_BLK) Register MASK  (Use USBHS_DEVEPTISR_BLK_Msk instead)  */
#define USBHS_DEVEPTISR_BLK_Msk             _U_(0x2005C)                                   /**< (USBHS_DEVEPTISR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_DEVEPTISR_INTRPT_RXSTPI_Pos   2                                              /**< (USBHS_DEVEPTISR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTISR_INTRPT_RXSTPI_Msk   (_U_(0x1) << USBHS_DEVEPTISR_INTRPT_RXSTPI_Pos)  /**< (USBHS_DEVEPTISR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTISR_INTRPT_RXSTPI       USBHS_DEVEPTISR_INTRPT_RXSTPI_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_INTRPT_RXSTPI_Msk instead */
#define USBHS_DEVEPTISR_INTRPT_NAKOUTI_Pos  3                                              /**< (USBHS_DEVEPTISR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTISR_INTRPT_NAKOUTI_Msk  (_U_(0x1) << USBHS_DEVEPTISR_INTRPT_NAKOUTI_Pos)  /**< (USBHS_DEVEPTISR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTISR_INTRPT_NAKOUTI      USBHS_DEVEPTISR_INTRPT_NAKOUTI_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_INTRPT_NAKOUTI_Msk instead */
#define USBHS_DEVEPTISR_INTRPT_NAKINI_Pos   4                                              /**< (USBHS_DEVEPTISR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTISR_INTRPT_NAKINI_Msk   (_U_(0x1) << USBHS_DEVEPTISR_INTRPT_NAKINI_Pos)  /**< (USBHS_DEVEPTISR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTISR_INTRPT_NAKINI       USBHS_DEVEPTISR_INTRPT_NAKINI_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_INTRPT_NAKINI_Msk instead */
#define USBHS_DEVEPTISR_INTRPT_STALLEDI_Pos 6                                              /**< (USBHS_DEVEPTISR) STALLed Interrupt Position */
#define USBHS_DEVEPTISR_INTRPT_STALLEDI_Msk (_U_(0x1) << USBHS_DEVEPTISR_INTRPT_STALLEDI_Pos)  /**< (USBHS_DEVEPTISR) STALLed Interrupt Mask */
#define USBHS_DEVEPTISR_INTRPT_STALLEDI     USBHS_DEVEPTISR_INTRPT_STALLEDI_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_INTRPT_STALLEDI_Msk instead */
#define USBHS_DEVEPTISR_INTRPT_CTRLDIR_Pos  17                                             /**< (USBHS_DEVEPTISR) Control Direction Position */
#define USBHS_DEVEPTISR_INTRPT_CTRLDIR_Msk  (_U_(0x1) << USBHS_DEVEPTISR_INTRPT_CTRLDIR_Pos)  /**< (USBHS_DEVEPTISR) Control Direction Mask */
#define USBHS_DEVEPTISR_INTRPT_CTRLDIR      USBHS_DEVEPTISR_INTRPT_CTRLDIR_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTISR_INTRPT_CTRLDIR_Msk instead */
#define USBHS_DEVEPTISR_INTRPT_MASK         _U_(0x2005C)                                   /**< \deprecated (USBHS_DEVEPTISR_INTRPT) Register MASK  (Use USBHS_DEVEPTISR_INTRPT_Msk instead)  */
#define USBHS_DEVEPTISR_INTRPT_Msk          _U_(0x2005C)                                   /**< (USBHS_DEVEPTISR_INTRPT) Register Mask  */


/* -------- USBHS_DEVEPTICR : (USBHS Offset: 0x160) (/W 32) Device Endpoint Interrupt Clear Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t TXINIC:1;                  /**< bit:      0  Transmitted IN Data Interrupt Clear      */
    uint32_t RXOUTIC:1;                 /**< bit:      1  Received OUT Data Interrupt Clear        */
    uint32_t :3;                        /**< bit:   2..4  Reserved */
    uint32_t OVERFIC:1;                 /**< bit:      5  Overflow Interrupt Clear                 */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKETC:1;            /**< bit:      7  Short Packet Interrupt Clear             */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPIC:1;                 /**< bit:      2  Received SETUP Interrupt Clear           */
    uint32_t NAKOUTIC:1;                /**< bit:      3  NAKed OUT Interrupt Clear                */
    uint32_t NAKINIC:1;                 /**< bit:      4  NAKed IN Interrupt Clear                 */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDIC:1;               /**< bit:      6  STALLed Interrupt Clear                  */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIC:1;                /**< bit:      2  Underflow Interrupt Clear                */
    uint32_t HBISOINERRIC:1;            /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt Clear */
    uint32_t HBISOFLUSHIC:1;            /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt Clear */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t CRCERRIC:1;                /**< bit:      6  CRC Error Interrupt Clear                */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPIC:1;                 /**< bit:      2  Received SETUP Interrupt Clear           */
    uint32_t NAKOUTIC:1;                /**< bit:      3  NAKed OUT Interrupt Clear                */
    uint32_t NAKINIC:1;                 /**< bit:      4  NAKed IN Interrupt Clear                 */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDIC:1;               /**< bit:      6  STALLed Interrupt Clear                  */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPIC:1;                 /**< bit:      2  Received SETUP Interrupt Clear           */
    uint32_t NAKOUTIC:1;                /**< bit:      3  NAKed OUT Interrupt Clear                */
    uint32_t NAKINIC:1;                 /**< bit:      4  NAKed IN Interrupt Clear                 */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDIC:1;               /**< bit:      6  STALLed Interrupt Clear                  */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_DEVEPTICR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_DEVEPTICR_OFFSET              (0x160)                                       /**<  (USBHS_DEVEPTICR) Device Endpoint Interrupt Clear Register  Offset */

#define USBHS_DEVEPTICR_TXINIC_Pos          0                                              /**< (USBHS_DEVEPTICR) Transmitted IN Data Interrupt Clear Position */
#define USBHS_DEVEPTICR_TXINIC_Msk          (_U_(0x1) << USBHS_DEVEPTICR_TXINIC_Pos)       /**< (USBHS_DEVEPTICR) Transmitted IN Data Interrupt Clear Mask */
#define USBHS_DEVEPTICR_TXINIC              USBHS_DEVEPTICR_TXINIC_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_TXINIC_Msk instead */
#define USBHS_DEVEPTICR_RXOUTIC_Pos         1                                              /**< (USBHS_DEVEPTICR) Received OUT Data Interrupt Clear Position */
#define USBHS_DEVEPTICR_RXOUTIC_Msk         (_U_(0x1) << USBHS_DEVEPTICR_RXOUTIC_Pos)      /**< (USBHS_DEVEPTICR) Received OUT Data Interrupt Clear Mask */
#define USBHS_DEVEPTICR_RXOUTIC             USBHS_DEVEPTICR_RXOUTIC_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_RXOUTIC_Msk instead */
#define USBHS_DEVEPTICR_OVERFIC_Pos         5                                              /**< (USBHS_DEVEPTICR) Overflow Interrupt Clear Position */
#define USBHS_DEVEPTICR_OVERFIC_Msk         (_U_(0x1) << USBHS_DEVEPTICR_OVERFIC_Pos)      /**< (USBHS_DEVEPTICR) Overflow Interrupt Clear Mask */
#define USBHS_DEVEPTICR_OVERFIC             USBHS_DEVEPTICR_OVERFIC_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_OVERFIC_Msk instead */
#define USBHS_DEVEPTICR_SHORTPACKETC_Pos    7                                              /**< (USBHS_DEVEPTICR) Short Packet Interrupt Clear Position */
#define USBHS_DEVEPTICR_SHORTPACKETC_Msk    (_U_(0x1) << USBHS_DEVEPTICR_SHORTPACKETC_Pos)  /**< (USBHS_DEVEPTICR) Short Packet Interrupt Clear Mask */
#define USBHS_DEVEPTICR_SHORTPACKETC        USBHS_DEVEPTICR_SHORTPACKETC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_SHORTPACKETC_Msk instead */
#define USBHS_DEVEPTICR_MASK                _U_(0xA3)                                      /**< \deprecated (USBHS_DEVEPTICR) Register MASK  (Use USBHS_DEVEPTICR_Msk instead)  */
#define USBHS_DEVEPTICR_Msk                 _U_(0xA3)                                      /**< (USBHS_DEVEPTICR) Register Mask  */

/* CTRL mode */
#define USBHS_DEVEPTICR_CTRL_RXSTPIC_Pos    2                                              /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTICR_CTRL_RXSTPIC_Msk    (_U_(0x1) << USBHS_DEVEPTICR_CTRL_RXSTPIC_Pos)  /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTICR_CTRL_RXSTPIC        USBHS_DEVEPTICR_CTRL_RXSTPIC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_CTRL_RXSTPIC_Msk instead */
#define USBHS_DEVEPTICR_CTRL_NAKOUTIC_Pos   3                                              /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTICR_CTRL_NAKOUTIC_Msk   (_U_(0x1) << USBHS_DEVEPTICR_CTRL_NAKOUTIC_Pos)  /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTICR_CTRL_NAKOUTIC       USBHS_DEVEPTICR_CTRL_NAKOUTIC_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_CTRL_NAKOUTIC_Msk instead */
#define USBHS_DEVEPTICR_CTRL_NAKINIC_Pos    4                                              /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTICR_CTRL_NAKINIC_Msk    (_U_(0x1) << USBHS_DEVEPTICR_CTRL_NAKINIC_Pos)  /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTICR_CTRL_NAKINIC        USBHS_DEVEPTICR_CTRL_NAKINIC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_CTRL_NAKINIC_Msk instead */
#define USBHS_DEVEPTICR_CTRL_STALLEDIC_Pos  6                                              /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTICR_CTRL_STALLEDIC_Msk  (_U_(0x1) << USBHS_DEVEPTICR_CTRL_STALLEDIC_Pos)  /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTICR_CTRL_STALLEDIC      USBHS_DEVEPTICR_CTRL_STALLEDIC_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_CTRL_STALLEDIC_Msk instead */
#define USBHS_DEVEPTICR_CTRL_MASK           _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTICR_CTRL) Register MASK  (Use USBHS_DEVEPTICR_CTRL_Msk instead)  */
#define USBHS_DEVEPTICR_CTRL_Msk            _U_(0x5C)                                      /**< (USBHS_DEVEPTICR_CTRL) Register Mask  */

