Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* ISO mode */
#define USBHS_DEVEPTICR_ISO_UNDERFIC_Pos    2                                              /**< (USBHS_DEVEPTICR) Underflow Interrupt Clear Position */
#define USBHS_DEVEPTICR_ISO_UNDERFIC_Msk    (_U_(0x1) << USBHS_DEVEPTICR_ISO_UNDERFIC_Pos)  /**< (USBHS_DEVEPTICR) Underflow Interrupt Clear Mask */
#define USBHS_DEVEPTICR_ISO_UNDERFIC        USBHS_DEVEPTICR_ISO_UNDERFIC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_ISO_UNDERFIC_Msk instead */
#define USBHS_DEVEPTICR_ISO_HBISOINERRIC_Pos 3                                              /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Position */
#define USBHS_DEVEPTICR_ISO_HBISOINERRIC_Msk (_U_(0x1) << USBHS_DEVEPTICR_ISO_HBISOINERRIC_Pos)  /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Mask */
#define USBHS_DEVEPTICR_ISO_HBISOINERRIC    USBHS_DEVEPTICR_ISO_HBISOINERRIC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_ISO_HBISOINERRIC_Msk instead */
#define USBHS_DEVEPTICR_ISO_HBISOFLUSHIC_Pos 4                                              /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Flush Interrupt Clear Position */
#define USBHS_DEVEPTICR_ISO_HBISOFLUSHIC_Msk (_U_(0x1) << USBHS_DEVEPTICR_ISO_HBISOFLUSHIC_Pos)  /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Flush Interrupt Clear Mask */
#define USBHS_DEVEPTICR_ISO_HBISOFLUSHIC    USBHS_DEVEPTICR_ISO_HBISOFLUSHIC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_ISO_HBISOFLUSHIC_Msk instead */
#define USBHS_DEVEPTICR_ISO_CRCERRIC_Pos    6                                              /**< (USBHS_DEVEPTICR) CRC Error Interrupt Clear Position */
#define USBHS_DEVEPTICR_ISO_CRCERRIC_Msk    (_U_(0x1) << USBHS_DEVEPTICR_ISO_CRCERRIC_Pos)  /**< (USBHS_DEVEPTICR) CRC Error Interrupt Clear Mask */
#define USBHS_DEVEPTICR_ISO_CRCERRIC        USBHS_DEVEPTICR_ISO_CRCERRIC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_ISO_CRCERRIC_Msk instead */
#define USBHS_DEVEPTICR_ISO_MASK            _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTICR_ISO) Register MASK  (Use USBHS_DEVEPTICR_ISO_Msk instead)  */
#define USBHS_DEVEPTICR_ISO_Msk             _U_(0x5C)                                      /**< (USBHS_DEVEPTICR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_DEVEPTICR_BLK_RXSTPIC_Pos     2                                              /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTICR_BLK_RXSTPIC_Msk     (_U_(0x1) << USBHS_DEVEPTICR_BLK_RXSTPIC_Pos)  /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTICR_BLK_RXSTPIC         USBHS_DEVEPTICR_BLK_RXSTPIC_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_BLK_RXSTPIC_Msk instead */
#define USBHS_DEVEPTICR_BLK_NAKOUTIC_Pos    3                                              /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTICR_BLK_NAKOUTIC_Msk    (_U_(0x1) << USBHS_DEVEPTICR_BLK_NAKOUTIC_Pos)  /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTICR_BLK_NAKOUTIC        USBHS_DEVEPTICR_BLK_NAKOUTIC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_BLK_NAKOUTIC_Msk instead */
#define USBHS_DEVEPTICR_BLK_NAKINIC_Pos     4                                              /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTICR_BLK_NAKINIC_Msk     (_U_(0x1) << USBHS_DEVEPTICR_BLK_NAKINIC_Pos)  /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTICR_BLK_NAKINIC         USBHS_DEVEPTICR_BLK_NAKINIC_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_BLK_NAKINIC_Msk instead */
#define USBHS_DEVEPTICR_BLK_STALLEDIC_Pos   6                                              /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTICR_BLK_STALLEDIC_Msk   (_U_(0x1) << USBHS_DEVEPTICR_BLK_STALLEDIC_Pos)  /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTICR_BLK_STALLEDIC       USBHS_DEVEPTICR_BLK_STALLEDIC_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_BLK_STALLEDIC_Msk instead */
#define USBHS_DEVEPTICR_BLK_MASK            _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTICR_BLK) Register MASK  (Use USBHS_DEVEPTICR_BLK_Msk instead)  */
#define USBHS_DEVEPTICR_BLK_Msk             _U_(0x5C)                                      /**< (USBHS_DEVEPTICR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_DEVEPTICR_INTRPT_RXSTPIC_Pos  2                                              /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTICR_INTRPT_RXSTPIC_Msk  (_U_(0x1) << USBHS_DEVEPTICR_INTRPT_RXSTPIC_Pos)  /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTICR_INTRPT_RXSTPIC      USBHS_DEVEPTICR_INTRPT_RXSTPIC_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_INTRPT_RXSTPIC_Msk instead */
#define USBHS_DEVEPTICR_INTRPT_NAKOUTIC_Pos 3                                              /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTICR_INTRPT_NAKOUTIC_Msk (_U_(0x1) << USBHS_DEVEPTICR_INTRPT_NAKOUTIC_Pos)  /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTICR_INTRPT_NAKOUTIC     USBHS_DEVEPTICR_INTRPT_NAKOUTIC_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_INTRPT_NAKOUTIC_Msk instead */
#define USBHS_DEVEPTICR_INTRPT_NAKINIC_Pos  4                                              /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTICR_INTRPT_NAKINIC_Msk  (_U_(0x1) << USBHS_DEVEPTICR_INTRPT_NAKINIC_Pos)  /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTICR_INTRPT_NAKINIC      USBHS_DEVEPTICR_INTRPT_NAKINIC_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_INTRPT_NAKINIC_Msk instead */
#define USBHS_DEVEPTICR_INTRPT_STALLEDIC_Pos 6                                              /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTICR_INTRPT_STALLEDIC_Msk (_U_(0x1) << USBHS_DEVEPTICR_INTRPT_STALLEDIC_Pos)  /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTICR_INTRPT_STALLEDIC    USBHS_DEVEPTICR_INTRPT_STALLEDIC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTICR_INTRPT_STALLEDIC_Msk instead */
#define USBHS_DEVEPTICR_INTRPT_MASK         _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTICR_INTRPT) Register MASK  (Use USBHS_DEVEPTICR_INTRPT_Msk instead)  */
#define USBHS_DEVEPTICR_INTRPT_Msk          _U_(0x5C)                                      /**< (USBHS_DEVEPTICR_INTRPT) Register Mask  */


/* -------- USBHS_DEVEPTIFR : (USBHS Offset: 0x190) (/W 32) Device Endpoint Interrupt Set Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t TXINIS:1;                  /**< bit:      0  Transmitted IN Data Interrupt Set        */
    uint32_t RXOUTIS:1;                 /**< bit:      1  Received OUT Data Interrupt Set          */
    uint32_t :3;                        /**< bit:   2..4  Reserved */
    uint32_t OVERFIS:1;                 /**< bit:      5  Overflow Interrupt Set                   */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKETS:1;            /**< bit:      7  Short Packet Interrupt Set               */
    uint32_t :4;                        /**< bit:  8..11  Reserved */
    uint32_t NBUSYBKS:1;                /**< bit:     12  Number of Busy Banks Interrupt Set       */
    uint32_t :19;                       /**< bit: 13..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPIS:1;                 /**< bit:      2  Received SETUP Interrupt Set             */
    uint32_t NAKOUTIS:1;                /**< bit:      3  NAKed OUT Interrupt Set                  */
    uint32_t NAKINIS:1;                 /**< bit:      4  NAKed IN Interrupt Set                   */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDIS:1;               /**< bit:      6  STALLed Interrupt Set                    */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIS:1;                /**< bit:      2  Underflow Interrupt Set                  */
    uint32_t HBISOINERRIS:1;            /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt Set */
    uint32_t HBISOFLUSHIS:1;            /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt Set */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t CRCERRIS:1;                /**< bit:      6  CRC Error Interrupt Set                  */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPIS:1;                 /**< bit:      2  Received SETUP Interrupt Set             */
    uint32_t NAKOUTIS:1;                /**< bit:      3  NAKed OUT Interrupt Set                  */
    uint32_t NAKINIS:1;                 /**< bit:      4  NAKed IN Interrupt Set                   */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDIS:1;               /**< bit:      6  STALLed Interrupt Set                    */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPIS:1;                 /**< bit:      2  Received SETUP Interrupt Set             */
    uint32_t NAKOUTIS:1;                /**< bit:      3  NAKed OUT Interrupt Set                  */
    uint32_t NAKINIS:1;                 /**< bit:      4  NAKed IN Interrupt Set                   */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDIS:1;               /**< bit:      6  STALLed Interrupt Set                    */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_DEVEPTIFR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_DEVEPTIFR_OFFSET              (0x190)                                       /**<  (USBHS_DEVEPTIFR) Device Endpoint Interrupt Set Register  Offset */

#define USBHS_DEVEPTIFR_TXINIS_Pos          0                                              /**< (USBHS_DEVEPTIFR) Transmitted IN Data Interrupt Set Position */
#define USBHS_DEVEPTIFR_TXINIS_Msk          (_U_(0x1) << USBHS_DEVEPTIFR_TXINIS_Pos)       /**< (USBHS_DEVEPTIFR) Transmitted IN Data Interrupt Set Mask */
#define USBHS_DEVEPTIFR_TXINIS              USBHS_DEVEPTIFR_TXINIS_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_TXINIS_Msk instead */
#define USBHS_DEVEPTIFR_RXOUTIS_Pos         1                                              /**< (USBHS_DEVEPTIFR) Received OUT Data Interrupt Set Position */
#define USBHS_DEVEPTIFR_RXOUTIS_Msk         (_U_(0x1) << USBHS_DEVEPTIFR_RXOUTIS_Pos)      /**< (USBHS_DEVEPTIFR) Received OUT Data Interrupt Set Mask */
#define USBHS_DEVEPTIFR_RXOUTIS             USBHS_DEVEPTIFR_RXOUTIS_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_RXOUTIS_Msk instead */
#define USBHS_DEVEPTIFR_OVERFIS_Pos         5                                              /**< (USBHS_DEVEPTIFR) Overflow Interrupt Set Position */
#define USBHS_DEVEPTIFR_OVERFIS_Msk         (_U_(0x1) << USBHS_DEVEPTIFR_OVERFIS_Pos)      /**< (USBHS_DEVEPTIFR) Overflow Interrupt Set Mask */
#define USBHS_DEVEPTIFR_OVERFIS             USBHS_DEVEPTIFR_OVERFIS_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_OVERFIS_Msk instead */
#define USBHS_DEVEPTIFR_SHORTPACKETS_Pos    7                                              /**< (USBHS_DEVEPTIFR) Short Packet Interrupt Set Position */
#define USBHS_DEVEPTIFR_SHORTPACKETS_Msk    (_U_(0x1) << USBHS_DEVEPTIFR_SHORTPACKETS_Pos)  /**< (USBHS_DEVEPTIFR) Short Packet Interrupt Set Mask */
#define USBHS_DEVEPTIFR_SHORTPACKETS        USBHS_DEVEPTIFR_SHORTPACKETS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_SHORTPACKETS_Msk instead */
#define USBHS_DEVEPTIFR_NBUSYBKS_Pos        12                                             /**< (USBHS_DEVEPTIFR) Number of Busy Banks Interrupt Set Position */
#define USBHS_DEVEPTIFR_NBUSYBKS_Msk        (_U_(0x1) << USBHS_DEVEPTIFR_NBUSYBKS_Pos)     /**< (USBHS_DEVEPTIFR) Number of Busy Banks Interrupt Set Mask */
#define USBHS_DEVEPTIFR_NBUSYBKS            USBHS_DEVEPTIFR_NBUSYBKS_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_NBUSYBKS_Msk instead */
#define USBHS_DEVEPTIFR_MASK                _U_(0x10A3)                                    /**< \deprecated (USBHS_DEVEPTIFR) Register MASK  (Use USBHS_DEVEPTIFR_Msk instead)  */
#define USBHS_DEVEPTIFR_Msk                 _U_(0x10A3)                                    /**< (USBHS_DEVEPTIFR) Register Mask  */

/* CTRL mode */
#define USBHS_DEVEPTIFR_CTRL_RXSTPIS_Pos    2                                              /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Position */
#define USBHS_DEVEPTIFR_CTRL_RXSTPIS_Msk    (_U_(0x1) << USBHS_DEVEPTIFR_CTRL_RXSTPIS_Pos)  /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Mask */
#define USBHS_DEVEPTIFR_CTRL_RXSTPIS        USBHS_DEVEPTIFR_CTRL_RXSTPIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_CTRL_RXSTPIS_Msk instead */
#define USBHS_DEVEPTIFR_CTRL_NAKOUTIS_Pos   3                                              /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Position */
#define USBHS_DEVEPTIFR_CTRL_NAKOUTIS_Msk   (_U_(0x1) << USBHS_DEVEPTIFR_CTRL_NAKOUTIS_Pos)  /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Mask */
#define USBHS_DEVEPTIFR_CTRL_NAKOUTIS       USBHS_DEVEPTIFR_CTRL_NAKOUTIS_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_CTRL_NAKOUTIS_Msk instead */
#define USBHS_DEVEPTIFR_CTRL_NAKINIS_Pos    4                                              /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Position */
#define USBHS_DEVEPTIFR_CTRL_NAKINIS_Msk    (_U_(0x1) << USBHS_DEVEPTIFR_CTRL_NAKINIS_Pos)  /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Mask */
#define USBHS_DEVEPTIFR_CTRL_NAKINIS        USBHS_DEVEPTIFR_CTRL_NAKINIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_CTRL_NAKINIS_Msk instead */
#define USBHS_DEVEPTIFR_CTRL_STALLEDIS_Pos  6                                              /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Position */
#define USBHS_DEVEPTIFR_CTRL_STALLEDIS_Msk  (_U_(0x1) << USBHS_DEVEPTIFR_CTRL_STALLEDIS_Pos)  /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Mask */
#define USBHS_DEVEPTIFR_CTRL_STALLEDIS      USBHS_DEVEPTIFR_CTRL_STALLEDIS_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_CTRL_STALLEDIS_Msk instead */
#define USBHS_DEVEPTIFR_CTRL_MASK           _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTIFR_CTRL) Register MASK  (Use USBHS_DEVEPTIFR_CTRL_Msk instead)  */
#define USBHS_DEVEPTIFR_CTRL_Msk            _U_(0x5C)                                      /**< (USBHS_DEVEPTIFR_CTRL) Register Mask  */

