Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* ISO mode */
#define USBHS_DEVEPTIFR_ISO_UNDERFIS_Pos    2                                              /**< (USBHS_DEVEPTIFR) Underflow Interrupt Set Position */
#define USBHS_DEVEPTIFR_ISO_UNDERFIS_Msk    (_U_(0x1) << USBHS_DEVEPTIFR_ISO_UNDERFIS_Pos)  /**< (USBHS_DEVEPTIFR) Underflow Interrupt Set Mask */
#define USBHS_DEVEPTIFR_ISO_UNDERFIS        USBHS_DEVEPTIFR_ISO_UNDERFIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_ISO_UNDERFIS_Msk instead */
#define USBHS_DEVEPTIFR_ISO_HBISOINERRIS_Pos 3                                              /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Underflow Error Interrupt Set Position */
#define USBHS_DEVEPTIFR_ISO_HBISOINERRIS_Msk (_U_(0x1) << USBHS_DEVEPTIFR_ISO_HBISOINERRIS_Pos)  /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Underflow Error Interrupt Set Mask */
#define USBHS_DEVEPTIFR_ISO_HBISOINERRIS    USBHS_DEVEPTIFR_ISO_HBISOINERRIS_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_ISO_HBISOINERRIS_Msk instead */
#define USBHS_DEVEPTIFR_ISO_HBISOFLUSHIS_Pos 4                                              /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Flush Interrupt Set Position */
#define USBHS_DEVEPTIFR_ISO_HBISOFLUSHIS_Msk (_U_(0x1) << USBHS_DEVEPTIFR_ISO_HBISOFLUSHIS_Pos)  /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Flush Interrupt Set Mask */
#define USBHS_DEVEPTIFR_ISO_HBISOFLUSHIS    USBHS_DEVEPTIFR_ISO_HBISOFLUSHIS_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_ISO_HBISOFLUSHIS_Msk instead */
#define USBHS_DEVEPTIFR_ISO_CRCERRIS_Pos    6                                              /**< (USBHS_DEVEPTIFR) CRC Error Interrupt Set Position */
#define USBHS_DEVEPTIFR_ISO_CRCERRIS_Msk    (_U_(0x1) << USBHS_DEVEPTIFR_ISO_CRCERRIS_Pos)  /**< (USBHS_DEVEPTIFR) CRC Error Interrupt Set Mask */
#define USBHS_DEVEPTIFR_ISO_CRCERRIS        USBHS_DEVEPTIFR_ISO_CRCERRIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_ISO_CRCERRIS_Msk instead */
#define USBHS_DEVEPTIFR_ISO_MASK            _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTIFR_ISO) Register MASK  (Use USBHS_DEVEPTIFR_ISO_Msk instead)  */
#define USBHS_DEVEPTIFR_ISO_Msk             _U_(0x5C)                                      /**< (USBHS_DEVEPTIFR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_DEVEPTIFR_BLK_RXSTPIS_Pos     2                                              /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Position */
#define USBHS_DEVEPTIFR_BLK_RXSTPIS_Msk     (_U_(0x1) << USBHS_DEVEPTIFR_BLK_RXSTPIS_Pos)  /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Mask */
#define USBHS_DEVEPTIFR_BLK_RXSTPIS         USBHS_DEVEPTIFR_BLK_RXSTPIS_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_BLK_RXSTPIS_Msk instead */
#define USBHS_DEVEPTIFR_BLK_NAKOUTIS_Pos    3                                              /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Position */
#define USBHS_DEVEPTIFR_BLK_NAKOUTIS_Msk    (_U_(0x1) << USBHS_DEVEPTIFR_BLK_NAKOUTIS_Pos)  /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Mask */
#define USBHS_DEVEPTIFR_BLK_NAKOUTIS        USBHS_DEVEPTIFR_BLK_NAKOUTIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_BLK_NAKOUTIS_Msk instead */
#define USBHS_DEVEPTIFR_BLK_NAKINIS_Pos     4                                              /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Position */
#define USBHS_DEVEPTIFR_BLK_NAKINIS_Msk     (_U_(0x1) << USBHS_DEVEPTIFR_BLK_NAKINIS_Pos)  /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Mask */
#define USBHS_DEVEPTIFR_BLK_NAKINIS         USBHS_DEVEPTIFR_BLK_NAKINIS_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_BLK_NAKINIS_Msk instead */
#define USBHS_DEVEPTIFR_BLK_STALLEDIS_Pos   6                                              /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Position */
#define USBHS_DEVEPTIFR_BLK_STALLEDIS_Msk   (_U_(0x1) << USBHS_DEVEPTIFR_BLK_STALLEDIS_Pos)  /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Mask */
#define USBHS_DEVEPTIFR_BLK_STALLEDIS       USBHS_DEVEPTIFR_BLK_STALLEDIS_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_BLK_STALLEDIS_Msk instead */
#define USBHS_DEVEPTIFR_BLK_MASK            _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTIFR_BLK) Register MASK  (Use USBHS_DEVEPTIFR_BLK_Msk instead)  */
#define USBHS_DEVEPTIFR_BLK_Msk             _U_(0x5C)                                      /**< (USBHS_DEVEPTIFR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_DEVEPTIFR_INTRPT_RXSTPIS_Pos  2                                              /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Position */
#define USBHS_DEVEPTIFR_INTRPT_RXSTPIS_Msk  (_U_(0x1) << USBHS_DEVEPTIFR_INTRPT_RXSTPIS_Pos)  /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Mask */
#define USBHS_DEVEPTIFR_INTRPT_RXSTPIS      USBHS_DEVEPTIFR_INTRPT_RXSTPIS_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_INTRPT_RXSTPIS_Msk instead */
#define USBHS_DEVEPTIFR_INTRPT_NAKOUTIS_Pos 3                                              /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Position */
#define USBHS_DEVEPTIFR_INTRPT_NAKOUTIS_Msk (_U_(0x1) << USBHS_DEVEPTIFR_INTRPT_NAKOUTIS_Pos)  /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Mask */
#define USBHS_DEVEPTIFR_INTRPT_NAKOUTIS     USBHS_DEVEPTIFR_INTRPT_NAKOUTIS_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_INTRPT_NAKOUTIS_Msk instead */
#define USBHS_DEVEPTIFR_INTRPT_NAKINIS_Pos  4                                              /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Position */
#define USBHS_DEVEPTIFR_INTRPT_NAKINIS_Msk  (_U_(0x1) << USBHS_DEVEPTIFR_INTRPT_NAKINIS_Pos)  /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Mask */
#define USBHS_DEVEPTIFR_INTRPT_NAKINIS      USBHS_DEVEPTIFR_INTRPT_NAKINIS_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_INTRPT_NAKINIS_Msk instead */
#define USBHS_DEVEPTIFR_INTRPT_STALLEDIS_Pos 6                                              /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Position */
#define USBHS_DEVEPTIFR_INTRPT_STALLEDIS_Msk (_U_(0x1) << USBHS_DEVEPTIFR_INTRPT_STALLEDIS_Pos)  /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Mask */
#define USBHS_DEVEPTIFR_INTRPT_STALLEDIS    USBHS_DEVEPTIFR_INTRPT_STALLEDIS_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIFR_INTRPT_STALLEDIS_Msk instead */
#define USBHS_DEVEPTIFR_INTRPT_MASK         _U_(0x5C)                                      /**< \deprecated (USBHS_DEVEPTIFR_INTRPT) Register MASK  (Use USBHS_DEVEPTIFR_INTRPT_Msk instead)  */
#define USBHS_DEVEPTIFR_INTRPT_Msk          _U_(0x5C)                                      /**< (USBHS_DEVEPTIFR_INTRPT) Register Mask  */


/* -------- USBHS_DEVEPTIMR : (USBHS Offset: 0x1c0) (R/ 32) Device Endpoint Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t TXINE:1;                   /**< bit:      0  Transmitted IN Data Interrupt            */
    uint32_t RXOUTE:1;                  /**< bit:      1  Received OUT Data Interrupt              */
    uint32_t :3;                        /**< bit:   2..4  Reserved */
    uint32_t OVERFE:1;                  /**< bit:      5  Overflow Interrupt                       */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKETE:1;            /**< bit:      7  Short Packet Interrupt                   */
    uint32_t :4;                        /**< bit:  8..11  Reserved */
    uint32_t NBUSYBKE:1;                /**< bit:     12  Number of Busy Banks Interrupt           */
    uint32_t KILLBK:1;                  /**< bit:     13  Kill IN Bank                             */
    uint32_t FIFOCON:1;                 /**< bit:     14  FIFO Control                             */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t EPDISHDMA:1;               /**< bit:     16  Endpoint Interrupts Disable HDMA Request */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t RSTDT:1;                   /**< bit:     18  Reset Data Toggle                        */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPE:1;                  /**< bit:      2  Received SETUP Interrupt                 */
    uint32_t NAKOUTE:1;                 /**< bit:      3  NAKed OUT Interrupt                      */
    uint32_t NAKINE:1;                  /**< bit:      4  NAKed IN Interrupt                       */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDE:1;                /**< bit:      6  STALLed Interrupt                        */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t NYETDIS:1;                 /**< bit:     17  NYET Token Disable                       */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t STALLRQ:1;                 /**< bit:     19  STALL Request                            */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFE:1;                 /**< bit:      2  Underflow Interrupt                      */
    uint32_t HBISOINERRE:1;             /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt */
    uint32_t HBISOFLUSHE:1;             /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t CRCERRE:1;                 /**< bit:      6  CRC Error Interrupt                      */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t MDATAE:1;                  /**< bit:      8  MData Interrupt                          */
    uint32_t DATAXE:1;                  /**< bit:      9  DataX Interrupt                          */
    uint32_t ERRORTRANSE:1;             /**< bit:     10  Transaction Error Interrupt              */
    uint32_t :21;                       /**< bit: 11..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPE:1;                  /**< bit:      2  Received SETUP Interrupt                 */
    uint32_t NAKOUTE:1;                 /**< bit:      3  NAKed OUT Interrupt                      */
    uint32_t NAKINE:1;                  /**< bit:      4  NAKed IN Interrupt                       */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDE:1;                /**< bit:      6  STALLed Interrupt                        */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t NYETDIS:1;                 /**< bit:     17  NYET Token Disable                       */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t STALLRQ:1;                 /**< bit:     19  STALL Request                            */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPE:1;                  /**< bit:      2  Received SETUP Interrupt                 */
    uint32_t NAKOUTE:1;                 /**< bit:      3  NAKed OUT Interrupt                      */
    uint32_t NAKINE:1;                  /**< bit:      4  NAKed IN Interrupt                       */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDE:1;                /**< bit:      6  STALLed Interrupt                        */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t NYETDIS:1;                 /**< bit:     17  NYET Token Disable                       */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t STALLRQ:1;                 /**< bit:     19  STALL Request                            */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_DEVEPTIMR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_DEVEPTIMR_OFFSET              (0x1C0)                                       /**<  (USBHS_DEVEPTIMR) Device Endpoint Interrupt Mask Register  Offset */

#define USBHS_DEVEPTIMR_TXINE_Pos           0                                              /**< (USBHS_DEVEPTIMR) Transmitted IN Data Interrupt Position */
#define USBHS_DEVEPTIMR_TXINE_Msk           (_U_(0x1) << USBHS_DEVEPTIMR_TXINE_Pos)        /**< (USBHS_DEVEPTIMR) Transmitted IN Data Interrupt Mask */
#define USBHS_DEVEPTIMR_TXINE               USBHS_DEVEPTIMR_TXINE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_TXINE_Msk instead */
#define USBHS_DEVEPTIMR_RXOUTE_Pos          1                                              /**< (USBHS_DEVEPTIMR) Received OUT Data Interrupt Position */
#define USBHS_DEVEPTIMR_RXOUTE_Msk          (_U_(0x1) << USBHS_DEVEPTIMR_RXOUTE_Pos)       /**< (USBHS_DEVEPTIMR) Received OUT Data Interrupt Mask */
#define USBHS_DEVEPTIMR_RXOUTE              USBHS_DEVEPTIMR_RXOUTE_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_RXOUTE_Msk instead */
#define USBHS_DEVEPTIMR_OVERFE_Pos          5                                              /**< (USBHS_DEVEPTIMR) Overflow Interrupt Position */
#define USBHS_DEVEPTIMR_OVERFE_Msk          (_U_(0x1) << USBHS_DEVEPTIMR_OVERFE_Pos)       /**< (USBHS_DEVEPTIMR) Overflow Interrupt Mask */
#define USBHS_DEVEPTIMR_OVERFE              USBHS_DEVEPTIMR_OVERFE_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_OVERFE_Msk instead */
#define USBHS_DEVEPTIMR_SHORTPACKETE_Pos    7                                              /**< (USBHS_DEVEPTIMR) Short Packet Interrupt Position */
#define USBHS_DEVEPTIMR_SHORTPACKETE_Msk    (_U_(0x1) << USBHS_DEVEPTIMR_SHORTPACKETE_Pos)  /**< (USBHS_DEVEPTIMR) Short Packet Interrupt Mask */
#define USBHS_DEVEPTIMR_SHORTPACKETE        USBHS_DEVEPTIMR_SHORTPACKETE_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_SHORTPACKETE_Msk instead */
#define USBHS_DEVEPTIMR_NBUSYBKE_Pos        12                                             /**< (USBHS_DEVEPTIMR) Number of Busy Banks Interrupt Position */
#define USBHS_DEVEPTIMR_NBUSYBKE_Msk        (_U_(0x1) << USBHS_DEVEPTIMR_NBUSYBKE_Pos)     /**< (USBHS_DEVEPTIMR) Number of Busy Banks Interrupt Mask */
#define USBHS_DEVEPTIMR_NBUSYBKE            USBHS_DEVEPTIMR_NBUSYBKE_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_NBUSYBKE_Msk instead */
#define USBHS_DEVEPTIMR_KILLBK_Pos          13                                             /**< (USBHS_DEVEPTIMR) Kill IN Bank Position */
#define USBHS_DEVEPTIMR_KILLBK_Msk          (_U_(0x1) << USBHS_DEVEPTIMR_KILLBK_Pos)       /**< (USBHS_DEVEPTIMR) Kill IN Bank Mask */
#define USBHS_DEVEPTIMR_KILLBK              USBHS_DEVEPTIMR_KILLBK_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_KILLBK_Msk instead */
#define USBHS_DEVEPTIMR_FIFOCON_Pos         14                                             /**< (USBHS_DEVEPTIMR) FIFO Control Position */
#define USBHS_DEVEPTIMR_FIFOCON_Msk         (_U_(0x1) << USBHS_DEVEPTIMR_FIFOCON_Pos)      /**< (USBHS_DEVEPTIMR) FIFO Control Mask */
#define USBHS_DEVEPTIMR_FIFOCON             USBHS_DEVEPTIMR_FIFOCON_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_FIFOCON_Msk instead */
#define USBHS_DEVEPTIMR_EPDISHDMA_Pos       16                                             /**< (USBHS_DEVEPTIMR) Endpoint Interrupts Disable HDMA Request Position */
#define USBHS_DEVEPTIMR_EPDISHDMA_Msk       (_U_(0x1) << USBHS_DEVEPTIMR_EPDISHDMA_Pos)    /**< (USBHS_DEVEPTIMR) Endpoint Interrupts Disable HDMA Request Mask */
#define USBHS_DEVEPTIMR_EPDISHDMA           USBHS_DEVEPTIMR_EPDISHDMA_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_EPDISHDMA_Msk instead */
#define USBHS_DEVEPTIMR_RSTDT_Pos           18                                             /**< (USBHS_DEVEPTIMR) Reset Data Toggle Position */
#define USBHS_DEVEPTIMR_RSTDT_Msk           (_U_(0x1) << USBHS_DEVEPTIMR_RSTDT_Pos)        /**< (USBHS_DEVEPTIMR) Reset Data Toggle Mask */
#define USBHS_DEVEPTIMR_RSTDT               USBHS_DEVEPTIMR_RSTDT_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_RSTDT_Msk instead */
#define USBHS_DEVEPTIMR_MASK                _U_(0x570A3)                                   /**< \deprecated (USBHS_DEVEPTIMR) Register MASK  (Use USBHS_DEVEPTIMR_Msk instead)  */
#define USBHS_DEVEPTIMR_Msk                 _U_(0x570A3)                                   /**< (USBHS_DEVEPTIMR) Register Mask  */

/* CTRL mode */
#define USBHS_DEVEPTIMR_CTRL_RXSTPE_Pos     2                                              /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_RXSTPE_Msk     (_U_(0x1) << USBHS_DEVEPTIMR_CTRL_RXSTPE_Pos)  /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_RXSTPE         USBHS_DEVEPTIMR_CTRL_RXSTPE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_CTRL_RXSTPE_Msk instead */
#define USBHS_DEVEPTIMR_CTRL_NAKOUTE_Pos    3                                              /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_NAKOUTE_Msk    (_U_(0x1) << USBHS_DEVEPTIMR_CTRL_NAKOUTE_Pos)  /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_NAKOUTE        USBHS_DEVEPTIMR_CTRL_NAKOUTE_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_CTRL_NAKOUTE_Msk instead */
#define USBHS_DEVEPTIMR_CTRL_NAKINE_Pos     4                                              /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_NAKINE_Msk     (_U_(0x1) << USBHS_DEVEPTIMR_CTRL_NAKINE_Pos)  /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_NAKINE         USBHS_DEVEPTIMR_CTRL_NAKINE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_CTRL_NAKINE_Msk instead */
#define USBHS_DEVEPTIMR_CTRL_STALLEDE_Pos   6                                              /**< (USBHS_DEVEPTIMR) STALLed Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_STALLEDE_Msk   (_U_(0x1) << USBHS_DEVEPTIMR_CTRL_STALLEDE_Pos)  /**< (USBHS_DEVEPTIMR) STALLed Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_STALLEDE       USBHS_DEVEPTIMR_CTRL_STALLEDE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_CTRL_STALLEDE_Msk instead */
#define USBHS_DEVEPTIMR_CTRL_NYETDIS_Pos    17                                             /**< (USBHS_DEVEPTIMR) NYET Token Disable Position */
#define USBHS_DEVEPTIMR_CTRL_NYETDIS_Msk    (_U_(0x1) << USBHS_DEVEPTIMR_CTRL_NYETDIS_Pos)  /**< (USBHS_DEVEPTIMR) NYET Token Disable Mask */
#define USBHS_DEVEPTIMR_CTRL_NYETDIS        USBHS_DEVEPTIMR_CTRL_NYETDIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_CTRL_NYETDIS_Msk instead */
#define USBHS_DEVEPTIMR_CTRL_STALLRQ_Pos    19                                             /**< (USBHS_DEVEPTIMR) STALL Request Position */
#define USBHS_DEVEPTIMR_CTRL_STALLRQ_Msk    (_U_(0x1) << USBHS_DEVEPTIMR_CTRL_STALLRQ_Pos)  /**< (USBHS_DEVEPTIMR) STALL Request Mask */
#define USBHS_DEVEPTIMR_CTRL_STALLRQ        USBHS_DEVEPTIMR_CTRL_STALLRQ_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_CTRL_STALLRQ_Msk instead */
#define USBHS_DEVEPTIMR_CTRL_MASK           _U_(0xA005C)                                   /**< \deprecated (USBHS_DEVEPTIMR_CTRL) Register MASK  (Use USBHS_DEVEPTIMR_CTRL_Msk instead)  */
#define USBHS_DEVEPTIMR_CTRL_Msk            _U_(0xA005C)                                   /**< (USBHS_DEVEPTIMR_CTRL) Register Mask  */

