Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* ISO mode */
#define USBHS_DEVEPTIMR_ISO_UNDERFE_Pos     2                                              /**< (USBHS_DEVEPTIMR) Underflow Interrupt Position */
#define USBHS_DEVEPTIMR_ISO_UNDERFE_Msk     (_U_(0x1) << USBHS_DEVEPTIMR_ISO_UNDERFE_Pos)  /**< (USBHS_DEVEPTIMR) Underflow Interrupt Mask */
#define USBHS_DEVEPTIMR_ISO_UNDERFE         USBHS_DEVEPTIMR_ISO_UNDERFE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_ISO_UNDERFE_Msk instead */
#define USBHS_DEVEPTIMR_ISO_HBISOINERRE_Pos 3                                              /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Underflow Error Interrupt Position */
#define USBHS_DEVEPTIMR_ISO_HBISOINERRE_Msk (_U_(0x1) << USBHS_DEVEPTIMR_ISO_HBISOINERRE_Pos)  /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Underflow Error Interrupt Mask */
#define USBHS_DEVEPTIMR_ISO_HBISOINERRE     USBHS_DEVEPTIMR_ISO_HBISOINERRE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_ISO_HBISOINERRE_Msk instead */
#define USBHS_DEVEPTIMR_ISO_HBISOFLUSHE_Pos 4                                              /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Flush Interrupt Position */
#define USBHS_DEVEPTIMR_ISO_HBISOFLUSHE_Msk (_U_(0x1) << USBHS_DEVEPTIMR_ISO_HBISOFLUSHE_Pos)  /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Flush Interrupt Mask */
#define USBHS_DEVEPTIMR_ISO_HBISOFLUSHE     USBHS_DEVEPTIMR_ISO_HBISOFLUSHE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_ISO_HBISOFLUSHE_Msk instead */
#define USBHS_DEVEPTIMR_ISO_CRCERRE_Pos     6                                              /**< (USBHS_DEVEPTIMR) CRC Error Interrupt Position */
#define USBHS_DEVEPTIMR_ISO_CRCERRE_Msk     (_U_(0x1) << USBHS_DEVEPTIMR_ISO_CRCERRE_Pos)  /**< (USBHS_DEVEPTIMR) CRC Error Interrupt Mask */
#define USBHS_DEVEPTIMR_ISO_CRCERRE         USBHS_DEVEPTIMR_ISO_CRCERRE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_ISO_CRCERRE_Msk instead */
#define USBHS_DEVEPTIMR_ISO_MDATAE_Pos      8                                              /**< (USBHS_DEVEPTIMR) MData Interrupt Position */
#define USBHS_DEVEPTIMR_ISO_MDATAE_Msk      (_U_(0x1) << USBHS_DEVEPTIMR_ISO_MDATAE_Pos)   /**< (USBHS_DEVEPTIMR) MData Interrupt Mask */
#define USBHS_DEVEPTIMR_ISO_MDATAE          USBHS_DEVEPTIMR_ISO_MDATAE_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_ISO_MDATAE_Msk instead */
#define USBHS_DEVEPTIMR_ISO_DATAXE_Pos      9                                              /**< (USBHS_DEVEPTIMR) DataX Interrupt Position */
#define USBHS_DEVEPTIMR_ISO_DATAXE_Msk      (_U_(0x1) << USBHS_DEVEPTIMR_ISO_DATAXE_Pos)   /**< (USBHS_DEVEPTIMR) DataX Interrupt Mask */
#define USBHS_DEVEPTIMR_ISO_DATAXE          USBHS_DEVEPTIMR_ISO_DATAXE_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_ISO_DATAXE_Msk instead */
#define USBHS_DEVEPTIMR_ISO_ERRORTRANSE_Pos 10                                             /**< (USBHS_DEVEPTIMR) Transaction Error Interrupt Position */
#define USBHS_DEVEPTIMR_ISO_ERRORTRANSE_Msk (_U_(0x1) << USBHS_DEVEPTIMR_ISO_ERRORTRANSE_Pos)  /**< (USBHS_DEVEPTIMR) Transaction Error Interrupt Mask */
#define USBHS_DEVEPTIMR_ISO_ERRORTRANSE     USBHS_DEVEPTIMR_ISO_ERRORTRANSE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_ISO_ERRORTRANSE_Msk instead */
#define USBHS_DEVEPTIMR_ISO_MASK            _U_(0x75C)                                     /**< \deprecated (USBHS_DEVEPTIMR_ISO) Register MASK  (Use USBHS_DEVEPTIMR_ISO_Msk instead)  */
#define USBHS_DEVEPTIMR_ISO_Msk             _U_(0x75C)                                     /**< (USBHS_DEVEPTIMR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_DEVEPTIMR_BLK_RXSTPE_Pos      2                                              /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTIMR_BLK_RXSTPE_Msk      (_U_(0x1) << USBHS_DEVEPTIMR_BLK_RXSTPE_Pos)   /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTIMR_BLK_RXSTPE          USBHS_DEVEPTIMR_BLK_RXSTPE_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_BLK_RXSTPE_Msk instead */
#define USBHS_DEVEPTIMR_BLK_NAKOUTE_Pos     3                                              /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTIMR_BLK_NAKOUTE_Msk     (_U_(0x1) << USBHS_DEVEPTIMR_BLK_NAKOUTE_Pos)  /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTIMR_BLK_NAKOUTE         USBHS_DEVEPTIMR_BLK_NAKOUTE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_BLK_NAKOUTE_Msk instead */
#define USBHS_DEVEPTIMR_BLK_NAKINE_Pos      4                                              /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTIMR_BLK_NAKINE_Msk      (_U_(0x1) << USBHS_DEVEPTIMR_BLK_NAKINE_Pos)   /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTIMR_BLK_NAKINE          USBHS_DEVEPTIMR_BLK_NAKINE_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_BLK_NAKINE_Msk instead */
#define USBHS_DEVEPTIMR_BLK_STALLEDE_Pos    6                                              /**< (USBHS_DEVEPTIMR) STALLed Interrupt Position */
#define USBHS_DEVEPTIMR_BLK_STALLEDE_Msk    (_U_(0x1) << USBHS_DEVEPTIMR_BLK_STALLEDE_Pos)  /**< (USBHS_DEVEPTIMR) STALLed Interrupt Mask */
#define USBHS_DEVEPTIMR_BLK_STALLEDE        USBHS_DEVEPTIMR_BLK_STALLEDE_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_BLK_STALLEDE_Msk instead */
#define USBHS_DEVEPTIMR_BLK_NYETDIS_Pos     17                                             /**< (USBHS_DEVEPTIMR) NYET Token Disable Position */
#define USBHS_DEVEPTIMR_BLK_NYETDIS_Msk     (_U_(0x1) << USBHS_DEVEPTIMR_BLK_NYETDIS_Pos)  /**< (USBHS_DEVEPTIMR) NYET Token Disable Mask */
#define USBHS_DEVEPTIMR_BLK_NYETDIS         USBHS_DEVEPTIMR_BLK_NYETDIS_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_BLK_NYETDIS_Msk instead */
#define USBHS_DEVEPTIMR_BLK_STALLRQ_Pos     19                                             /**< (USBHS_DEVEPTIMR) STALL Request Position */
#define USBHS_DEVEPTIMR_BLK_STALLRQ_Msk     (_U_(0x1) << USBHS_DEVEPTIMR_BLK_STALLRQ_Pos)  /**< (USBHS_DEVEPTIMR) STALL Request Mask */
#define USBHS_DEVEPTIMR_BLK_STALLRQ         USBHS_DEVEPTIMR_BLK_STALLRQ_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_BLK_STALLRQ_Msk instead */
#define USBHS_DEVEPTIMR_BLK_MASK            _U_(0xA005C)                                   /**< \deprecated (USBHS_DEVEPTIMR_BLK) Register MASK  (Use USBHS_DEVEPTIMR_BLK_Msk instead)  */
#define USBHS_DEVEPTIMR_BLK_Msk             _U_(0xA005C)                                   /**< (USBHS_DEVEPTIMR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_DEVEPTIMR_INTRPT_RXSTPE_Pos   2                                              /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTIMR_INTRPT_RXSTPE_Msk   (_U_(0x1) << USBHS_DEVEPTIMR_INTRPT_RXSTPE_Pos)  /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTIMR_INTRPT_RXSTPE       USBHS_DEVEPTIMR_INTRPT_RXSTPE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_INTRPT_RXSTPE_Msk instead */
#define USBHS_DEVEPTIMR_INTRPT_NAKOUTE_Pos  3                                              /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTIMR_INTRPT_NAKOUTE_Msk  (_U_(0x1) << USBHS_DEVEPTIMR_INTRPT_NAKOUTE_Pos)  /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTIMR_INTRPT_NAKOUTE      USBHS_DEVEPTIMR_INTRPT_NAKOUTE_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_INTRPT_NAKOUTE_Msk instead */
#define USBHS_DEVEPTIMR_INTRPT_NAKINE_Pos   4                                              /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTIMR_INTRPT_NAKINE_Msk   (_U_(0x1) << USBHS_DEVEPTIMR_INTRPT_NAKINE_Pos)  /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTIMR_INTRPT_NAKINE       USBHS_DEVEPTIMR_INTRPT_NAKINE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_INTRPT_NAKINE_Msk instead */
#define USBHS_DEVEPTIMR_INTRPT_STALLEDE_Pos 6                                              /**< (USBHS_DEVEPTIMR) STALLed Interrupt Position */
#define USBHS_DEVEPTIMR_INTRPT_STALLEDE_Msk (_U_(0x1) << USBHS_DEVEPTIMR_INTRPT_STALLEDE_Pos)  /**< (USBHS_DEVEPTIMR) STALLed Interrupt Mask */
#define USBHS_DEVEPTIMR_INTRPT_STALLEDE     USBHS_DEVEPTIMR_INTRPT_STALLEDE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_INTRPT_STALLEDE_Msk instead */
#define USBHS_DEVEPTIMR_INTRPT_NYETDIS_Pos  17                                             /**< (USBHS_DEVEPTIMR) NYET Token Disable Position */
#define USBHS_DEVEPTIMR_INTRPT_NYETDIS_Msk  (_U_(0x1) << USBHS_DEVEPTIMR_INTRPT_NYETDIS_Pos)  /**< (USBHS_DEVEPTIMR) NYET Token Disable Mask */
#define USBHS_DEVEPTIMR_INTRPT_NYETDIS      USBHS_DEVEPTIMR_INTRPT_NYETDIS_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_INTRPT_NYETDIS_Msk instead */
#define USBHS_DEVEPTIMR_INTRPT_STALLRQ_Pos  19                                             /**< (USBHS_DEVEPTIMR) STALL Request Position */
#define USBHS_DEVEPTIMR_INTRPT_STALLRQ_Msk  (_U_(0x1) << USBHS_DEVEPTIMR_INTRPT_STALLRQ_Pos)  /**< (USBHS_DEVEPTIMR) STALL Request Mask */
#define USBHS_DEVEPTIMR_INTRPT_STALLRQ      USBHS_DEVEPTIMR_INTRPT_STALLRQ_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIMR_INTRPT_STALLRQ_Msk instead */
#define USBHS_DEVEPTIMR_INTRPT_MASK         _U_(0xA005C)                                   /**< \deprecated (USBHS_DEVEPTIMR_INTRPT) Register MASK  (Use USBHS_DEVEPTIMR_INTRPT_Msk instead)  */
#define USBHS_DEVEPTIMR_INTRPT_Msk          _U_(0xA005C)                                   /**< (USBHS_DEVEPTIMR_INTRPT) Register Mask  */


/* -------- USBHS_DEVEPTIER : (USBHS Offset: 0x1f0) (/W 32) Device Endpoint Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t TXINES:1;                  /**< bit:      0  Transmitted IN Data Interrupt Enable     */
    uint32_t RXOUTES:1;                 /**< bit:      1  Received OUT Data Interrupt Enable       */
    uint32_t :3;                        /**< bit:   2..4  Reserved */
    uint32_t OVERFES:1;                 /**< bit:      5  Overflow Interrupt Enable                */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKETES:1;           /**< bit:      7  Short Packet Interrupt Enable            */
    uint32_t :4;                        /**< bit:  8..11  Reserved */
    uint32_t NBUSYBKES:1;               /**< bit:     12  Number of Busy Banks Interrupt Enable    */
    uint32_t KILLBKS:1;                 /**< bit:     13  Kill IN Bank                             */
    uint32_t FIFOCONS:1;                /**< bit:     14  FIFO Control                             */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t EPDISHDMAS:1;              /**< bit:     16  Endpoint Interrupts Disable HDMA Request Enable */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t RSTDTS:1;                  /**< bit:     18  Reset Data Toggle Enable                 */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPES:1;                 /**< bit:      2  Received SETUP Interrupt Enable          */
    uint32_t NAKOUTES:1;                /**< bit:      3  NAKed OUT Interrupt Enable               */
    uint32_t NAKINES:1;                 /**< bit:      4  NAKed IN Interrupt Enable                */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDES:1;               /**< bit:      6  STALLed Interrupt Enable                 */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t NYETDISS:1;                /**< bit:     17  NYET Token Disable Enable                */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t STALLRQS:1;                /**< bit:     19  STALL Request Enable                     */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFES:1;                /**< bit:      2  Underflow Interrupt Enable               */
    uint32_t HBISOINERRES:1;            /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt Enable */
    uint32_t HBISOFLUSHES:1;            /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt Enable */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t CRCERRES:1;                /**< bit:      6  CRC Error Interrupt Enable               */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t MDATAES:1;                 /**< bit:      8  MData Interrupt Enable                   */
    uint32_t DATAXES:1;                 /**< bit:      9  DataX Interrupt Enable                   */
    uint32_t ERRORTRANSES:1;            /**< bit:     10  Transaction Error Interrupt Enable       */
    uint32_t :21;                       /**< bit: 11..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPES:1;                 /**< bit:      2  Received SETUP Interrupt Enable          */
    uint32_t NAKOUTES:1;                /**< bit:      3  NAKed OUT Interrupt Enable               */
    uint32_t NAKINES:1;                 /**< bit:      4  NAKed IN Interrupt Enable                */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDES:1;               /**< bit:      6  STALLed Interrupt Enable                 */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t NYETDISS:1;                /**< bit:     17  NYET Token Disable Enable                */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t STALLRQS:1;                /**< bit:     19  STALL Request Enable                     */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXSTPES:1;                 /**< bit:      2  Received SETUP Interrupt Enable          */
    uint32_t NAKOUTES:1;                /**< bit:      3  NAKed OUT Interrupt Enable               */
    uint32_t NAKINES:1;                 /**< bit:      4  NAKed IN Interrupt Enable                */
    uint32_t :1;                        /**< bit:      5  Reserved */
    uint32_t STALLEDES:1;               /**< bit:      6  STALLed Interrupt Enable                 */
    uint32_t :10;                       /**< bit:  7..16  Reserved */
    uint32_t NYETDISS:1;                /**< bit:     17  NYET Token Disable Enable                */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t STALLRQS:1;                /**< bit:     19  STALL Request Enable                     */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_DEVEPTIER_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_DEVEPTIER_OFFSET              (0x1F0)                                       /**<  (USBHS_DEVEPTIER) Device Endpoint Interrupt Enable Register  Offset */

