Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* CTRL mode */
#define USBHS_DEVEPTIDR_CTRL_RXSTPEC_Pos    2                                              /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTIDR_CTRL_RXSTPEC_Msk    (_U_(0x1) << USBHS_DEVEPTIDR_CTRL_RXSTPEC_Pos)  /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_CTRL_RXSTPEC        USBHS_DEVEPTIDR_CTRL_RXSTPEC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_CTRL_RXSTPEC_Msk instead */
#define USBHS_DEVEPTIDR_CTRL_NAKOUTEC_Pos   3                                              /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTIDR_CTRL_NAKOUTEC_Msk   (_U_(0x1) << USBHS_DEVEPTIDR_CTRL_NAKOUTEC_Pos)  /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_CTRL_NAKOUTEC       USBHS_DEVEPTIDR_CTRL_NAKOUTEC_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_CTRL_NAKOUTEC_Msk instead */
#define USBHS_DEVEPTIDR_CTRL_NAKINEC_Pos    4                                              /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTIDR_CTRL_NAKINEC_Msk    (_U_(0x1) << USBHS_DEVEPTIDR_CTRL_NAKINEC_Pos)  /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_CTRL_NAKINEC        USBHS_DEVEPTIDR_CTRL_NAKINEC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_CTRL_NAKINEC_Msk instead */
#define USBHS_DEVEPTIDR_CTRL_STALLEDEC_Pos  6                                              /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTIDR_CTRL_STALLEDEC_Msk  (_U_(0x1) << USBHS_DEVEPTIDR_CTRL_STALLEDEC_Pos)  /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_CTRL_STALLEDEC      USBHS_DEVEPTIDR_CTRL_STALLEDEC_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_CTRL_STALLEDEC_Msk instead */
#define USBHS_DEVEPTIDR_CTRL_NYETDISC_Pos   17                                             /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Position */
#define USBHS_DEVEPTIDR_CTRL_NYETDISC_Msk   (_U_(0x1) << USBHS_DEVEPTIDR_CTRL_NYETDISC_Pos)  /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Mask */
#define USBHS_DEVEPTIDR_CTRL_NYETDISC       USBHS_DEVEPTIDR_CTRL_NYETDISC_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_CTRL_NYETDISC_Msk instead */
#define USBHS_DEVEPTIDR_CTRL_STALLRQC_Pos   19                                             /**< (USBHS_DEVEPTIDR) STALL Request Clear Position */
#define USBHS_DEVEPTIDR_CTRL_STALLRQC_Msk   (_U_(0x1) << USBHS_DEVEPTIDR_CTRL_STALLRQC_Pos)  /**< (USBHS_DEVEPTIDR) STALL Request Clear Mask */
#define USBHS_DEVEPTIDR_CTRL_STALLRQC       USBHS_DEVEPTIDR_CTRL_STALLRQC_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_CTRL_STALLRQC_Msk instead */
#define USBHS_DEVEPTIDR_CTRL_MASK           _U_(0xA005C)                                   /**< \deprecated (USBHS_DEVEPTIDR_CTRL) Register MASK  (Use USBHS_DEVEPTIDR_CTRL_Msk instead)  */
#define USBHS_DEVEPTIDR_CTRL_Msk            _U_(0xA005C)                                   /**< (USBHS_DEVEPTIDR_CTRL) Register Mask  */

/* ISO mode */
#define USBHS_DEVEPTIDR_ISO_UNDERFEC_Pos    2                                              /**< (USBHS_DEVEPTIDR) Underflow Interrupt Clear Position */
#define USBHS_DEVEPTIDR_ISO_UNDERFEC_Msk    (_U_(0x1) << USBHS_DEVEPTIDR_ISO_UNDERFEC_Pos)  /**< (USBHS_DEVEPTIDR) Underflow Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_ISO_UNDERFEC        USBHS_DEVEPTIDR_ISO_UNDERFEC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_ISO_UNDERFEC_Msk instead */
#define USBHS_DEVEPTIDR_ISO_HBISOINERREC_Pos 3                                              /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Position */
#define USBHS_DEVEPTIDR_ISO_HBISOINERREC_Msk (_U_(0x1) << USBHS_DEVEPTIDR_ISO_HBISOINERREC_Pos)  /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_ISO_HBISOINERREC    USBHS_DEVEPTIDR_ISO_HBISOINERREC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_ISO_HBISOINERREC_Msk instead */
#define USBHS_DEVEPTIDR_ISO_HBISOFLUSHEC_Pos 4                                              /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Flush Interrupt Clear Position */
#define USBHS_DEVEPTIDR_ISO_HBISOFLUSHEC_Msk (_U_(0x1) << USBHS_DEVEPTIDR_ISO_HBISOFLUSHEC_Pos)  /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Flush Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_ISO_HBISOFLUSHEC    USBHS_DEVEPTIDR_ISO_HBISOFLUSHEC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_ISO_HBISOFLUSHEC_Msk instead */
#define USBHS_DEVEPTIDR_ISO_MDATAEC_Pos     8                                              /**< (USBHS_DEVEPTIDR) MData Interrupt Clear Position */
#define USBHS_DEVEPTIDR_ISO_MDATAEC_Msk     (_U_(0x1) << USBHS_DEVEPTIDR_ISO_MDATAEC_Pos)  /**< (USBHS_DEVEPTIDR) MData Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_ISO_MDATAEC         USBHS_DEVEPTIDR_ISO_MDATAEC_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_ISO_MDATAEC_Msk instead */
#define USBHS_DEVEPTIDR_ISO_DATAXEC_Pos     9                                              /**< (USBHS_DEVEPTIDR) DataX Interrupt Clear Position */
#define USBHS_DEVEPTIDR_ISO_DATAXEC_Msk     (_U_(0x1) << USBHS_DEVEPTIDR_ISO_DATAXEC_Pos)  /**< (USBHS_DEVEPTIDR) DataX Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_ISO_DATAXEC         USBHS_DEVEPTIDR_ISO_DATAXEC_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_ISO_DATAXEC_Msk instead */
#define USBHS_DEVEPTIDR_ISO_ERRORTRANSEC_Pos 10                                             /**< (USBHS_DEVEPTIDR) Transaction Error Interrupt Clear Position */
#define USBHS_DEVEPTIDR_ISO_ERRORTRANSEC_Msk (_U_(0x1) << USBHS_DEVEPTIDR_ISO_ERRORTRANSEC_Pos)  /**< (USBHS_DEVEPTIDR) Transaction Error Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_ISO_ERRORTRANSEC    USBHS_DEVEPTIDR_ISO_ERRORTRANSEC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_ISO_ERRORTRANSEC_Msk instead */
#define USBHS_DEVEPTIDR_ISO_MASK            _U_(0x71C)                                     /**< \deprecated (USBHS_DEVEPTIDR_ISO) Register MASK  (Use USBHS_DEVEPTIDR_ISO_Msk instead)  */
#define USBHS_DEVEPTIDR_ISO_Msk             _U_(0x71C)                                     /**< (USBHS_DEVEPTIDR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_DEVEPTIDR_BLK_RXSTPEC_Pos     2                                              /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTIDR_BLK_RXSTPEC_Msk     (_U_(0x1) << USBHS_DEVEPTIDR_BLK_RXSTPEC_Pos)  /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_BLK_RXSTPEC         USBHS_DEVEPTIDR_BLK_RXSTPEC_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_BLK_RXSTPEC_Msk instead */
#define USBHS_DEVEPTIDR_BLK_NAKOUTEC_Pos    3                                              /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTIDR_BLK_NAKOUTEC_Msk    (_U_(0x1) << USBHS_DEVEPTIDR_BLK_NAKOUTEC_Pos)  /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_BLK_NAKOUTEC        USBHS_DEVEPTIDR_BLK_NAKOUTEC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_BLK_NAKOUTEC_Msk instead */
#define USBHS_DEVEPTIDR_BLK_NAKINEC_Pos     4                                              /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTIDR_BLK_NAKINEC_Msk     (_U_(0x1) << USBHS_DEVEPTIDR_BLK_NAKINEC_Pos)  /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_BLK_NAKINEC         USBHS_DEVEPTIDR_BLK_NAKINEC_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_BLK_NAKINEC_Msk instead */
#define USBHS_DEVEPTIDR_BLK_STALLEDEC_Pos   6                                              /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTIDR_BLK_STALLEDEC_Msk   (_U_(0x1) << USBHS_DEVEPTIDR_BLK_STALLEDEC_Pos)  /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_BLK_STALLEDEC       USBHS_DEVEPTIDR_BLK_STALLEDEC_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_BLK_STALLEDEC_Msk instead */
#define USBHS_DEVEPTIDR_BLK_NYETDISC_Pos    17                                             /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Position */
#define USBHS_DEVEPTIDR_BLK_NYETDISC_Msk    (_U_(0x1) << USBHS_DEVEPTIDR_BLK_NYETDISC_Pos)  /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Mask */
#define USBHS_DEVEPTIDR_BLK_NYETDISC        USBHS_DEVEPTIDR_BLK_NYETDISC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_BLK_NYETDISC_Msk instead */
#define USBHS_DEVEPTIDR_BLK_STALLRQC_Pos    19                                             /**< (USBHS_DEVEPTIDR) STALL Request Clear Position */
#define USBHS_DEVEPTIDR_BLK_STALLRQC_Msk    (_U_(0x1) << USBHS_DEVEPTIDR_BLK_STALLRQC_Pos)  /**< (USBHS_DEVEPTIDR) STALL Request Clear Mask */
#define USBHS_DEVEPTIDR_BLK_STALLRQC        USBHS_DEVEPTIDR_BLK_STALLRQC_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_BLK_STALLRQC_Msk instead */
#define USBHS_DEVEPTIDR_BLK_MASK            _U_(0xA005C)                                   /**< \deprecated (USBHS_DEVEPTIDR_BLK) Register MASK  (Use USBHS_DEVEPTIDR_BLK_Msk instead)  */
#define USBHS_DEVEPTIDR_BLK_Msk             _U_(0xA005C)                                   /**< (USBHS_DEVEPTIDR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_DEVEPTIDR_INTRPT_RXSTPEC_Pos  2                                              /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTIDR_INTRPT_RXSTPEC_Msk  (_U_(0x1) << USBHS_DEVEPTIDR_INTRPT_RXSTPEC_Pos)  /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_INTRPT_RXSTPEC      USBHS_DEVEPTIDR_INTRPT_RXSTPEC_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_INTRPT_RXSTPEC_Msk instead */
#define USBHS_DEVEPTIDR_INTRPT_NAKOUTEC_Pos 3                                              /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTIDR_INTRPT_NAKOUTEC_Msk (_U_(0x1) << USBHS_DEVEPTIDR_INTRPT_NAKOUTEC_Pos)  /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_INTRPT_NAKOUTEC     USBHS_DEVEPTIDR_INTRPT_NAKOUTEC_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_INTRPT_NAKOUTEC_Msk instead */
#define USBHS_DEVEPTIDR_INTRPT_NAKINEC_Pos  4                                              /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTIDR_INTRPT_NAKINEC_Msk  (_U_(0x1) << USBHS_DEVEPTIDR_INTRPT_NAKINEC_Pos)  /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_INTRPT_NAKINEC      USBHS_DEVEPTIDR_INTRPT_NAKINEC_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_INTRPT_NAKINEC_Msk instead */
#define USBHS_DEVEPTIDR_INTRPT_STALLEDEC_Pos 6                                              /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTIDR_INTRPT_STALLEDEC_Msk (_U_(0x1) << USBHS_DEVEPTIDR_INTRPT_STALLEDEC_Pos)  /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_INTRPT_STALLEDEC    USBHS_DEVEPTIDR_INTRPT_STALLEDEC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_INTRPT_STALLEDEC_Msk instead */
#define USBHS_DEVEPTIDR_INTRPT_NYETDISC_Pos 17                                             /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Position */
#define USBHS_DEVEPTIDR_INTRPT_NYETDISC_Msk (_U_(0x1) << USBHS_DEVEPTIDR_INTRPT_NYETDISC_Pos)  /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Mask */
#define USBHS_DEVEPTIDR_INTRPT_NYETDISC     USBHS_DEVEPTIDR_INTRPT_NYETDISC_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_INTRPT_NYETDISC_Msk instead */
#define USBHS_DEVEPTIDR_INTRPT_STALLRQC_Pos 19                                             /**< (USBHS_DEVEPTIDR) STALL Request Clear Position */
#define USBHS_DEVEPTIDR_INTRPT_STALLRQC_Msk (_U_(0x1) << USBHS_DEVEPTIDR_INTRPT_STALLRQC_Pos)  /**< (USBHS_DEVEPTIDR) STALL Request Clear Mask */
#define USBHS_DEVEPTIDR_INTRPT_STALLRQC     USBHS_DEVEPTIDR_INTRPT_STALLRQC_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_DEVEPTIDR_INTRPT_STALLRQC_Msk instead */
#define USBHS_DEVEPTIDR_INTRPT_MASK         _U_(0xA005C)                                   /**< \deprecated (USBHS_DEVEPTIDR_INTRPT) Register MASK  (Use USBHS_DEVEPTIDR_INTRPT_Msk instead)  */
#define USBHS_DEVEPTIDR_INTRPT_Msk          _U_(0xA005C)                                   /**< (USBHS_DEVEPTIDR_INTRPT) Register Mask  */


