Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
#define USBHS_HSTADDR2_OFFSET               (0x428)                                       /**<  (USBHS_HSTADDR2) Host Address 2 Register  Offset */

#define USBHS_HSTADDR2_HSTADDRP4_Pos        0                                              /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP4_Msk        (_U_(0x7F) << USBHS_HSTADDR2_HSTADDRP4_Pos)    /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP4(value)     (USBHS_HSTADDR2_HSTADDRP4_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP4_Pos))
#define USBHS_HSTADDR2_HSTADDRP5_Pos        8                                              /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP5_Msk        (_U_(0x7F) << USBHS_HSTADDR2_HSTADDRP5_Pos)    /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP5(value)     (USBHS_HSTADDR2_HSTADDRP5_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP5_Pos))
#define USBHS_HSTADDR2_HSTADDRP6_Pos        16                                             /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP6_Msk        (_U_(0x7F) << USBHS_HSTADDR2_HSTADDRP6_Pos)    /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP6(value)     (USBHS_HSTADDR2_HSTADDRP6_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP6_Pos))
#define USBHS_HSTADDR2_HSTADDRP7_Pos        24                                             /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP7_Msk        (_U_(0x7F) << USBHS_HSTADDR2_HSTADDRP7_Pos)    /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP7(value)     (USBHS_HSTADDR2_HSTADDRP7_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP7_Pos))
#define USBHS_HSTADDR2_MASK                 _U_(0x7F7F7F7F)                                /**< \deprecated (USBHS_HSTADDR2) Register MASK  (Use USBHS_HSTADDR2_Msk instead)  */
#define USBHS_HSTADDR2_Msk                  _U_(0x7F7F7F7F)                                /**< (USBHS_HSTADDR2) Register Mask  */


/* -------- USBHS_HSTADDR3 : (USBHS Offset: 0x42c) (R/W 32) Host Address 3 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t HSTADDRP8:7;               /**< bit:   0..6  USB Host Address                         */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t HSTADDRP9:7;               /**< bit:  8..14  USB Host Address                         */
    uint32_t :17;                       /**< bit: 15..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_HSTADDR3_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_HSTADDR3_OFFSET               (0x42C)                                       /**<  (USBHS_HSTADDR3) Host Address 3 Register  Offset */

#define USBHS_HSTADDR3_HSTADDRP8_Pos        0                                              /**< (USBHS_HSTADDR3) USB Host Address Position */
#define USBHS_HSTADDR3_HSTADDRP8_Msk        (_U_(0x7F) << USBHS_HSTADDR3_HSTADDRP8_Pos)    /**< (USBHS_HSTADDR3) USB Host Address Mask */
#define USBHS_HSTADDR3_HSTADDRP8(value)     (USBHS_HSTADDR3_HSTADDRP8_Msk & ((value) << USBHS_HSTADDR3_HSTADDRP8_Pos))
#define USBHS_HSTADDR3_HSTADDRP9_Pos        8                                              /**< (USBHS_HSTADDR3) USB Host Address Position */
#define USBHS_HSTADDR3_HSTADDRP9_Msk        (_U_(0x7F) << USBHS_HSTADDR3_HSTADDRP9_Pos)    /**< (USBHS_HSTADDR3) USB Host Address Mask */
#define USBHS_HSTADDR3_HSTADDRP9(value)     (USBHS_HSTADDR3_HSTADDRP9_Msk & ((value) << USBHS_HSTADDR3_HSTADDRP9_Pos))
#define USBHS_HSTADDR3_MASK                 _U_(0x7F7F)                                    /**< \deprecated (USBHS_HSTADDR3) Register MASK  (Use USBHS_HSTADDR3_Msk instead)  */
#define USBHS_HSTADDR3_Msk                  _U_(0x7F7F)                                    /**< (USBHS_HSTADDR3) Register Mask  */


/* -------- USBHS_HSTPIPCFG : (USBHS Offset: 0x500) (R/W 32) Host Pipe Configuration Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t ALLOC:1;                   /**< bit:      1  Pipe Memory Allocate                     */
    uint32_t PBK:2;                     /**< bit:   2..3  Pipe Banks                               */
    uint32_t PSIZE:3;                   /**< bit:   4..6  Pipe Size                                */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t PTOKEN:2;                  /**< bit:   8..9  Pipe Token                               */
    uint32_t AUTOSW:1;                  /**< bit:     10  Automatic Switch                         */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t PTYPE:2;                   /**< bit: 12..13  Pipe Type                                */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t PEPNUM:4;                  /**< bit: 16..19  Pipe Endpoint Number                     */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t INTFRQ:8;                  /**< bit: 24..31  Pipe Interrupt Request Frequency         */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL_BULK mode
    uint32_t :20;                       /**< bit:  0..19  Reserved */
    uint32_t PINGEN:1;                  /**< bit:     20  Ping Enable                              */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t BINTERVAL:8;               /**< bit: 24..31  bInterval Parameter for the Bulk-Out/Ping Transaction */
  } CTRL_BULK;                                /**< Structure used for CTRL_BULK mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_HSTPIPCFG_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

