Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* CTRL mode */
#define USBHS_HSTPIPISR_CTRL_TXSTPI_Pos     2                                              /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Position */
#define USBHS_HSTPIPISR_CTRL_TXSTPI_Msk     (_U_(0x1) << USBHS_HSTPIPISR_CTRL_TXSTPI_Pos)  /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Mask */
#define USBHS_HSTPIPISR_CTRL_TXSTPI         USBHS_HSTPIPISR_CTRL_TXSTPI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_CTRL_TXSTPI_Msk instead */
#define USBHS_HSTPIPISR_CTRL_RXSTALLDI_Pos  6                                              /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_CTRL_RXSTALLDI_Msk  (_U_(0x1) << USBHS_HSTPIPISR_CTRL_RXSTALLDI_Pos)  /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
#define USBHS_HSTPIPISR_CTRL_RXSTALLDI      USBHS_HSTPIPISR_CTRL_RXSTALLDI_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_CTRL_RXSTALLDI_Msk instead */
#define USBHS_HSTPIPISR_CTRL_MASK           _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPISR_CTRL) Register MASK  (Use USBHS_HSTPIPISR_CTRL_Msk instead)  */
#define USBHS_HSTPIPISR_CTRL_Msk            _U_(0x44)                                      /**< (USBHS_HSTPIPISR_CTRL) Register Mask  */

/* ISO mode */
#define USBHS_HSTPIPISR_ISO_UNDERFI_Pos     2                                              /**< (USBHS_HSTPIPISR) Underflow Interrupt Position */
#define USBHS_HSTPIPISR_ISO_UNDERFI_Msk     (_U_(0x1) << USBHS_HSTPIPISR_ISO_UNDERFI_Pos)  /**< (USBHS_HSTPIPISR) Underflow Interrupt Mask */
#define USBHS_HSTPIPISR_ISO_UNDERFI         USBHS_HSTPIPISR_ISO_UNDERFI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_ISO_UNDERFI_Msk instead */
#define USBHS_HSTPIPISR_ISO_CRCERRI_Pos     6                                              /**< (USBHS_HSTPIPISR) CRC Error Interrupt Position */
#define USBHS_HSTPIPISR_ISO_CRCERRI_Msk     (_U_(0x1) << USBHS_HSTPIPISR_ISO_CRCERRI_Pos)  /**< (USBHS_HSTPIPISR) CRC Error Interrupt Mask */
#define USBHS_HSTPIPISR_ISO_CRCERRI         USBHS_HSTPIPISR_ISO_CRCERRI_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_ISO_CRCERRI_Msk instead */
#define USBHS_HSTPIPISR_ISO_MASK            _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPISR_ISO) Register MASK  (Use USBHS_HSTPIPISR_ISO_Msk instead)  */
#define USBHS_HSTPIPISR_ISO_Msk             _U_(0x44)                                      /**< (USBHS_HSTPIPISR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPISR_BLK_TXSTPI_Pos      2                                              /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Position */
#define USBHS_HSTPIPISR_BLK_TXSTPI_Msk      (_U_(0x1) << USBHS_HSTPIPISR_BLK_TXSTPI_Pos)   /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Mask */
#define USBHS_HSTPIPISR_BLK_TXSTPI          USBHS_HSTPIPISR_BLK_TXSTPI_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_BLK_TXSTPI_Msk instead */
#define USBHS_HSTPIPISR_BLK_RXSTALLDI_Pos   6                                              /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_BLK_RXSTALLDI_Msk   (_U_(0x1) << USBHS_HSTPIPISR_BLK_RXSTALLDI_Pos)  /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
#define USBHS_HSTPIPISR_BLK_RXSTALLDI       USBHS_HSTPIPISR_BLK_RXSTALLDI_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_BLK_RXSTALLDI_Msk instead */
#define USBHS_HSTPIPISR_BLK_MASK            _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPISR_BLK) Register MASK  (Use USBHS_HSTPIPISR_BLK_Msk instead)  */
#define USBHS_HSTPIPISR_BLK_Msk             _U_(0x44)                                      /**< (USBHS_HSTPIPISR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPISR_INTRPT_UNDERFI_Pos  2                                              /**< (USBHS_HSTPIPISR) Underflow Interrupt Position */
#define USBHS_HSTPIPISR_INTRPT_UNDERFI_Msk  (_U_(0x1) << USBHS_HSTPIPISR_INTRPT_UNDERFI_Pos)  /**< (USBHS_HSTPIPISR) Underflow Interrupt Mask */
#define USBHS_HSTPIPISR_INTRPT_UNDERFI      USBHS_HSTPIPISR_INTRPT_UNDERFI_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_INTRPT_UNDERFI_Msk instead */
#define USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Pos 6                                              /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Msk (_U_(0x1) << USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Pos)  /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
#define USBHS_HSTPIPISR_INTRPT_RXSTALLDI    USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Msk instead */
#define USBHS_HSTPIPISR_INTRPT_MASK         _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPISR_INTRPT) Register MASK  (Use USBHS_HSTPIPISR_INTRPT_Msk instead)  */
#define USBHS_HSTPIPISR_INTRPT_Msk          _U_(0x44)                                      /**< (USBHS_HSTPIPISR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPICR : (USBHS Offset: 0x560) (/W 32) Host Pipe Clear Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RXINIC:1;                  /**< bit:      0  Received IN Data Interrupt Clear         */
    uint32_t TXOUTIC:1;                 /**< bit:      1  Transmitted OUT Data Interrupt Clear     */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t NAKEDIC:1;                 /**< bit:      4  NAKed Interrupt Clear                    */
    uint32_t OVERFIC:1;                 /**< bit:      5  Overflow Interrupt Clear                 */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKETIC:1;           /**< bit:      7  Short Packet Interrupt Clear             */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t TXSTPIC:1;                 /**< bit:      2  Transmitted SETUP Interrupt Clear        */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDIC:1;              /**< bit:      6  Received STALLed Interrupt Clear         */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIC:1;                /**< bit:      2  Underflow Interrupt Clear                */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t CRCERRIC:1;                /**< bit:      6  CRC Error Interrupt Clear                */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t TXSTPIC:1;                 /**< bit:      2  Transmitted SETUP Interrupt Clear        */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDIC:1;              /**< bit:      6  Received STALLed Interrupt Clear         */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIC:1;                /**< bit:      2  Underflow Interrupt Clear                */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDIC:1;              /**< bit:      6  Received STALLed Interrupt Clear         */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_HSTPIPICR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

