Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPIFR_ISO_UNDERFIS_Pos    2                                              /**< (USBHS_HSTPIPIFR) Underflow Interrupt Set Position */
#define USBHS_HSTPIPIFR_ISO_UNDERFIS_Msk    (_U_(0x1) << USBHS_HSTPIPIFR_ISO_UNDERFIS_Pos)  /**< (USBHS_HSTPIPIFR) Underflow Interrupt Set Mask */
#define USBHS_HSTPIPIFR_ISO_UNDERFIS        USBHS_HSTPIPIFR_ISO_UNDERFIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_ISO_UNDERFIS_Msk instead */
#define USBHS_HSTPIPIFR_ISO_CRCERRIS_Pos    6                                              /**< (USBHS_HSTPIPIFR) CRC Error Interrupt Set Position */
#define USBHS_HSTPIPIFR_ISO_CRCERRIS_Msk    (_U_(0x1) << USBHS_HSTPIPIFR_ISO_CRCERRIS_Pos)  /**< (USBHS_HSTPIPIFR) CRC Error Interrupt Set Mask */
#define USBHS_HSTPIPIFR_ISO_CRCERRIS        USBHS_HSTPIPIFR_ISO_CRCERRIS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_ISO_CRCERRIS_Msk instead */
#define USBHS_HSTPIPIFR_ISO_MASK            _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPIFR_ISO) Register MASK  (Use USBHS_HSTPIPIFR_ISO_Msk instead)  */
#define USBHS_HSTPIPIFR_ISO_Msk             _U_(0x44)                                      /**< (USBHS_HSTPIPIFR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPIFR_BLK_TXSTPIS_Pos     2                                              /**< (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Position */
#define USBHS_HSTPIPIFR_BLK_TXSTPIS_Msk     (_U_(0x1) << USBHS_HSTPIPIFR_BLK_TXSTPIS_Pos)  /**< (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Mask */
#define USBHS_HSTPIPIFR_BLK_TXSTPIS         USBHS_HSTPIPIFR_BLK_TXSTPIS_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_BLK_TXSTPIS_Msk instead */
#define USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Pos  6                                              /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Position */
#define USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Msk  (_U_(0x1) << USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Pos)  /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_BLK_RXSTALLDIS      USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Msk instead */
#define USBHS_HSTPIPIFR_BLK_MASK            _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPIFR_BLK) Register MASK  (Use USBHS_HSTPIPIFR_BLK_Msk instead)  */
#define USBHS_HSTPIPIFR_BLK_Msk             _U_(0x44)                                      /**< (USBHS_HSTPIPIFR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Pos 2                                              /**< (USBHS_HSTPIPIFR) Underflow Interrupt Set Position */
#define USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Msk (_U_(0x1) << USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Pos)  /**< (USBHS_HSTPIPIFR) Underflow Interrupt Set Mask */
#define USBHS_HSTPIPIFR_INTRPT_UNDERFIS     USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Msk instead */
#define USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Pos 6                                              /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Position */
#define USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Msk (_U_(0x1) << USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Pos)  /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS   USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Msk instead */
#define USBHS_HSTPIPIFR_INTRPT_MASK         _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPIFR_INTRPT) Register MASK  (Use USBHS_HSTPIPIFR_INTRPT_Msk instead)  */
#define USBHS_HSTPIPIFR_INTRPT_Msk          _U_(0x44)                                      /**< (USBHS_HSTPIPIFR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPIMR : (USBHS Offset: 0x5c0) (R/ 32) Host Pipe Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RXINE:1;                   /**< bit:      0  Received IN Data Interrupt Enable        */
    uint32_t TXOUTE:1;                  /**< bit:      1  Transmitted OUT Data Interrupt Enable    */
    uint32_t :1;                        /**< bit:      2  Reserved */
    uint32_t PERRE:1;                   /**< bit:      3  Pipe Error Interrupt Enable              */
    uint32_t NAKEDE:1;                  /**< bit:      4  NAKed Interrupt Enable                   */
    uint32_t OVERFIE:1;                 /**< bit:      5  Overflow Interrupt Enable                */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKETIE:1;           /**< bit:      7  Short Packet Interrupt Enable            */
    uint32_t :4;                        /**< bit:  8..11  Reserved */
    uint32_t NBUSYBKE:1;                /**< bit:     12  Number of Busy Banks Interrupt Enable    */
    uint32_t :1;                        /**< bit:     13  Reserved */
    uint32_t FIFOCON:1;                 /**< bit:     14  FIFO Control                             */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t PDISHDMA:1;                /**< bit:     16  Pipe Interrupts Disable HDMA Request Enable */
    uint32_t PFREEZE:1;                 /**< bit:     17  Pipe Freeze                              */
    uint32_t RSTDT:1;                   /**< bit:     18  Reset Data Toggle                        */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t TXSTPE:1;                  /**< bit:      2  Transmitted SETUP Interrupt Enable       */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDE:1;               /**< bit:      6  Received STALLed Interrupt Enable        */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIE:1;                /**< bit:      2  Underflow Interrupt Enable               */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t CRCERRE:1;                 /**< bit:      6  CRC Error Interrupt Enable               */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t TXSTPE:1;                  /**< bit:      2  Transmitted SETUP Interrupt Enable       */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDE:1;               /**< bit:      6  Received STALLed Interrupt Enable        */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIE:1;                /**< bit:      2  Underflow Interrupt Enable               */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDE:1;               /**< bit:      6  Received STALLed Interrupt Enable        */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_HSTPIPIMR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_HSTPIPIMR_OFFSET              (0x5C0)                                       /**<  (USBHS_HSTPIPIMR) Host Pipe Mask Register  Offset */

#define USBHS_HSTPIPIMR_RXINE_Pos           0                                              /**< (USBHS_HSTPIPIMR) Received IN Data Interrupt Enable Position */
#define USBHS_HSTPIPIMR_RXINE_Msk           (_U_(0x1) << USBHS_HSTPIPIMR_RXINE_Pos)        /**< (USBHS_HSTPIPIMR) Received IN Data Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_RXINE               USBHS_HSTPIPIMR_RXINE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_RXINE_Msk instead */
#define USBHS_HSTPIPIMR_TXOUTE_Pos          1                                              /**< (USBHS_HSTPIPIMR) Transmitted OUT Data Interrupt Enable Position */
#define USBHS_HSTPIPIMR_TXOUTE_Msk          (_U_(0x1) << USBHS_HSTPIPIMR_TXOUTE_Pos)       /**< (USBHS_HSTPIPIMR) Transmitted OUT Data Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_TXOUTE              USBHS_HSTPIPIMR_TXOUTE_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_TXOUTE_Msk instead */
#define USBHS_HSTPIPIMR_PERRE_Pos           3                                              /**< (USBHS_HSTPIPIMR) Pipe Error Interrupt Enable Position */
#define USBHS_HSTPIPIMR_PERRE_Msk           (_U_(0x1) << USBHS_HSTPIPIMR_PERRE_Pos)        /**< (USBHS_HSTPIPIMR) Pipe Error Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_PERRE               USBHS_HSTPIPIMR_PERRE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_PERRE_Msk instead */
#define USBHS_HSTPIPIMR_NAKEDE_Pos          4                                              /**< (USBHS_HSTPIPIMR) NAKed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_NAKEDE_Msk          (_U_(0x1) << USBHS_HSTPIPIMR_NAKEDE_Pos)       /**< (USBHS_HSTPIPIMR) NAKed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_NAKEDE              USBHS_HSTPIPIMR_NAKEDE_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_NAKEDE_Msk instead */
#define USBHS_HSTPIPIMR_OVERFIE_Pos         5                                              /**< (USBHS_HSTPIPIMR) Overflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_OVERFIE_Msk         (_U_(0x1) << USBHS_HSTPIPIMR_OVERFIE_Pos)      /**< (USBHS_HSTPIPIMR) Overflow Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_OVERFIE             USBHS_HSTPIPIMR_OVERFIE_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_OVERFIE_Msk instead */
#define USBHS_HSTPIPIMR_SHORTPACKETIE_Pos   7                                              /**< (USBHS_HSTPIPIMR) Short Packet Interrupt Enable Position */
#define USBHS_HSTPIPIMR_SHORTPACKETIE_Msk   (_U_(0x1) << USBHS_HSTPIPIMR_SHORTPACKETIE_Pos)  /**< (USBHS_HSTPIPIMR) Short Packet Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_SHORTPACKETIE       USBHS_HSTPIPIMR_SHORTPACKETIE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_SHORTPACKETIE_Msk instead */
#define USBHS_HSTPIPIMR_NBUSYBKE_Pos        12                                             /**< (USBHS_HSTPIPIMR) Number of Busy Banks Interrupt Enable Position */
#define USBHS_HSTPIPIMR_NBUSYBKE_Msk        (_U_(0x1) << USBHS_HSTPIPIMR_NBUSYBKE_Pos)     /**< (USBHS_HSTPIPIMR) Number of Busy Banks Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_NBUSYBKE            USBHS_HSTPIPIMR_NBUSYBKE_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_NBUSYBKE_Msk instead */
#define USBHS_HSTPIPIMR_FIFOCON_Pos         14                                             /**< (USBHS_HSTPIPIMR) FIFO Control Position */
#define USBHS_HSTPIPIMR_FIFOCON_Msk         (_U_(0x1) << USBHS_HSTPIPIMR_FIFOCON_Pos)      /**< (USBHS_HSTPIPIMR) FIFO Control Mask */
#define USBHS_HSTPIPIMR_FIFOCON             USBHS_HSTPIPIMR_FIFOCON_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_FIFOCON_Msk instead */
#define USBHS_HSTPIPIMR_PDISHDMA_Pos        16                                             /**< (USBHS_HSTPIPIMR) Pipe Interrupts Disable HDMA Request Enable Position */
#define USBHS_HSTPIPIMR_PDISHDMA_Msk        (_U_(0x1) << USBHS_HSTPIPIMR_PDISHDMA_Pos)     /**< (USBHS_HSTPIPIMR) Pipe Interrupts Disable HDMA Request Enable Mask */
#define USBHS_HSTPIPIMR_PDISHDMA            USBHS_HSTPIPIMR_PDISHDMA_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_PDISHDMA_Msk instead */
#define USBHS_HSTPIPIMR_PFREEZE_Pos         17                                             /**< (USBHS_HSTPIPIMR) Pipe Freeze Position */
#define USBHS_HSTPIPIMR_PFREEZE_Msk         (_U_(0x1) << USBHS_HSTPIPIMR_PFREEZE_Pos)      /**< (USBHS_HSTPIPIMR) Pipe Freeze Mask */
#define USBHS_HSTPIPIMR_PFREEZE             USBHS_HSTPIPIMR_PFREEZE_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_PFREEZE_Msk instead */
#define USBHS_HSTPIPIMR_RSTDT_Pos           18                                             /**< (USBHS_HSTPIPIMR) Reset Data Toggle Position */
#define USBHS_HSTPIPIMR_RSTDT_Msk           (_U_(0x1) << USBHS_HSTPIPIMR_RSTDT_Pos)        /**< (USBHS_HSTPIPIMR) Reset Data Toggle Mask */
#define USBHS_HSTPIPIMR_RSTDT               USBHS_HSTPIPIMR_RSTDT_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_RSTDT_Msk instead */
#define USBHS_HSTPIPIMR_MASK                _U_(0x750BB)                                   /**< \deprecated (USBHS_HSTPIPIMR) Register MASK  (Use USBHS_HSTPIPIMR_Msk instead)  */
#define USBHS_HSTPIPIMR_Msk                 _U_(0x750BB)                                   /**< (USBHS_HSTPIPIMR) Register Mask  */

/* CTRL mode */
#define USBHS_HSTPIPIMR_CTRL_TXSTPE_Pos     2                                              /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIMR_CTRL_TXSTPE_Msk     (_U_(0x1) << USBHS_HSTPIPIMR_CTRL_TXSTPE_Pos)  /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_CTRL_TXSTPE         USBHS_HSTPIPIMR_CTRL_TXSTPE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_CTRL_TXSTPE_Msk instead */
#define USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Pos  6                                              /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Msk  (_U_(0x1) << USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Pos)  /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_CTRL_RXSTALLDE      USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Msk instead */
#define USBHS_HSTPIPIMR_CTRL_MASK           _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPIMR_CTRL) Register MASK  (Use USBHS_HSTPIPIMR_CTRL_Msk instead)  */
#define USBHS_HSTPIPIMR_CTRL_Msk            _U_(0x44)                                      /**< (USBHS_HSTPIPIMR_CTRL) Register Mask  */

