Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPIMR_ISO_UNDERFIE_Pos    2                                              /**< (USBHS_HSTPIPIMR) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_ISO_UNDERFIE_Msk    (_U_(0x1) << USBHS_HSTPIPIMR_ISO_UNDERFIE_Pos)  /**< (USBHS_HSTPIPIMR) Underflow Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_ISO_UNDERFIE        USBHS_HSTPIPIMR_ISO_UNDERFIE_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_ISO_UNDERFIE_Msk instead */
#define USBHS_HSTPIPIMR_ISO_CRCERRE_Pos     6                                              /**< (USBHS_HSTPIPIMR) CRC Error Interrupt Enable Position */
#define USBHS_HSTPIPIMR_ISO_CRCERRE_Msk     (_U_(0x1) << USBHS_HSTPIPIMR_ISO_CRCERRE_Pos)  /**< (USBHS_HSTPIPIMR) CRC Error Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_ISO_CRCERRE         USBHS_HSTPIPIMR_ISO_CRCERRE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_ISO_CRCERRE_Msk instead */
#define USBHS_HSTPIPIMR_ISO_MASK            _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPIMR_ISO) Register MASK  (Use USBHS_HSTPIPIMR_ISO_Msk instead)  */
#define USBHS_HSTPIPIMR_ISO_Msk             _U_(0x44)                                      /**< (USBHS_HSTPIPIMR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPIMR_BLK_TXSTPE_Pos      2                                              /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIMR_BLK_TXSTPE_Msk      (_U_(0x1) << USBHS_HSTPIPIMR_BLK_TXSTPE_Pos)   /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_BLK_TXSTPE          USBHS_HSTPIPIMR_BLK_TXSTPE_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_BLK_TXSTPE_Msk instead */
#define USBHS_HSTPIPIMR_BLK_RXSTALLDE_Pos   6                                              /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_BLK_RXSTALLDE_Msk   (_U_(0x1) << USBHS_HSTPIPIMR_BLK_RXSTALLDE_Pos)  /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_BLK_RXSTALLDE       USBHS_HSTPIPIMR_BLK_RXSTALLDE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_BLK_RXSTALLDE_Msk instead */
#define USBHS_HSTPIPIMR_BLK_MASK            _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPIMR_BLK) Register MASK  (Use USBHS_HSTPIPIMR_BLK_Msk instead)  */
#define USBHS_HSTPIPIMR_BLK_Msk             _U_(0x44)                                      /**< (USBHS_HSTPIPIMR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Pos 2                                              /**< (USBHS_HSTPIPIMR) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Msk (_U_(0x1) << USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Pos)  /**< (USBHS_HSTPIPIMR) Underflow Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_INTRPT_UNDERFIE     USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Msk instead */
#define USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Pos 6                                              /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Msk (_U_(0x1) << USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Pos)  /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_INTRPT_RXSTALLDE    USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Msk instead */
#define USBHS_HSTPIPIMR_INTRPT_MASK         _U_(0x44)                                      /**< \deprecated (USBHS_HSTPIPIMR_INTRPT) Register MASK  (Use USBHS_HSTPIPIMR_INTRPT_Msk instead)  */
#define USBHS_HSTPIPIMR_INTRPT_Msk          _U_(0x44)                                      /**< (USBHS_HSTPIPIMR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPIER : (USBHS Offset: 0x5f0) (/W 32) Host Pipe Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RXINES:1;                  /**< bit:      0  Received IN Data Interrupt Enable        */
    uint32_t TXOUTES:1;                 /**< bit:      1  Transmitted OUT Data Interrupt Enable    */
    uint32_t :1;                        /**< bit:      2  Reserved */
    uint32_t PERRES:1;                  /**< bit:      3  Pipe Error Interrupt Enable              */
    uint32_t NAKEDES:1;                 /**< bit:      4  NAKed Interrupt Enable                   */
    uint32_t OVERFIES:1;                /**< bit:      5  Overflow Interrupt Enable                */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t SHORTPACKETIES:1;          /**< bit:      7  Short Packet Interrupt Enable            */
    uint32_t :4;                        /**< bit:  8..11  Reserved */
    uint32_t NBUSYBKES:1;               /**< bit:     12  Number of Busy Banks Enable              */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t PDISHDMAS:1;               /**< bit:     16  Pipe Interrupts Disable HDMA Request Enable */
    uint32_t PFREEZES:1;                /**< bit:     17  Pipe Freeze Enable                       */
    uint32_t RSTDTS:1;                  /**< bit:     18  Reset Data Toggle Enable                 */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // CTRL mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t TXSTPES:1;                 /**< bit:      2  Transmitted SETUP Interrupt Enable       */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDES:1;              /**< bit:      6  Received STALLed Interrupt Enable        */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } CTRL;                                /**< Structure used for CTRL mode access */
  struct { // ISO mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIES:1;               /**< bit:      2  Underflow Interrupt Enable               */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t CRCERRES:1;                /**< bit:      6  CRC Error Interrupt Enable               */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } ISO;                                /**< Structure used for ISO mode access */
  struct { // BLK mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t TXSTPES:1;                 /**< bit:      2  Transmitted SETUP Interrupt Enable       */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDES:1;              /**< bit:      6  Received STALLed Interrupt Enable        */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } BLK;                                /**< Structure used for BLK mode access */
  struct { // INTRPT mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t UNDERFIES:1;               /**< bit:      2  Underflow Interrupt Enable               */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t RXSTALLDES:1;              /**< bit:      6  Received STALLed Interrupt Enable        */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } INTRPT;                                /**< Structure used for INTRPT mode access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_HSTPIPIER_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_HSTPIPIER_OFFSET              (0x5F0)                                       /**<  (USBHS_HSTPIPIER) Host Pipe Enable Register  Offset */

